8997 .
6378 ,
6348 :
6277 <num>
6064 the
4691 to
3550 a
3474 in
3236 's
3106 of
3037 is
2670 and
2530 for
2364 on
2307 rt
2083 aapl
2026 %
1720 it
1650 ;
1520 fb
1489 ?
1427 <num>.<num>
1355 -
1346 this
1301 earnings
1270 twtr
1209 &
1173 apple
1131 with
1044 spy
1040 i
1037 amp
1030 amzn
1027 at
1006 tsla
 994 as
 978 up
 976 you
 971 that
 916 by
 910 n't
 902 spx
 900 ''
 897 ``
 849 are
 844 from
 837 be
 831 stock
 824 (
 812 )
 778 but
 773 via
 748 has
 740 after
 739 today
 737 not
 723 stocks
 716 more
 715 now
 709 will
 702 !
 689 its
 683 new
 681 s
 644 how
 636 ...
 596 trump
 587 have
 582 nflx
 579 market
 575 down
 570 we
 554 '
 549 if
 547 gs
 532 here
 532 facebook
 531 just
 520 about
 510 out
 509 was
 508 what
 508 says
 493 googl
 481 so
 474 tesla
 468 shares
 468 amazon
 466 why
 456 revenue
 442 do
 432 nvda
 430 could
 429 all
 428 sales
 428 high
 427 twitter
 413 big
 409 year
 405 eps
 405 --
 389 time
 387 day
 385 <num>.<num>b
 382 trading
 380 than
 379 bac
 378 over
 377 see
 375 or
 363 like
 359 one
 358 us
 358 last
 356 my
 356 an
 353 some
 352 msft
 351 trade
 351 mcd
 350 ceo
 341 no
 337 growth
 336 good
 333 vrx
 326 buy
 325 since
 321 sbux
 320 they
 320 goog
 319 baba
 313 can
 308 vs.
 308 get
 298 consensus
 290 into
 289 still
 288 week
 278 news
 277 watch
 277 company
 271 there
 271 record
 271 long
 271 iphone
 266 netflix
 262 next
 260 xom
 260 call
 257 may
 257 great
 256 tech
 256 p
 255 reports
 254 highs
 253 years
 252 should
 251 options
 251 billion
 250 snap
 249 china
 248 been
 247 all-time
 246 back
 244 does
 242 your
 242 higher
 241 too
 236 price
 236 intc
 235 <num>,<num>
 231 cat
 228 wall
 228 most
 227 when
 227 below
 225 investors
 225 google
 224 right
 223 u.s.
 223 top
 218 these
 218 live
 215 yhoo
 215 gld
 214 ibm
 214 estimize
 213 think
 212 would
 212 street
 212 he
 210 +<num>
 208 off
 208 dow
 206 sell
 206 low
 205 take
 204 our
 201 who
 200 close
 199 move
 199 bank
 199 ahead
 198 other
 198 c
 197 qqq
 196 expected
 193 gild
 192 again
 191 much
 190 their
 190 oil
 189 best
 188 breaking
 187 above
 185 did
 184 goldman
 183 yesterday
 183 markets
 181 short
 180 djia
 179 jpm
 176 another
 175 quarter
 174 deal
 174 csco
 173 're
 172 report
 172 getting
 171 nke
 171 iwm
 171 going
 170 way
 170 qcom
 170 nvidia
 170 first
 169 mcdonald
 169 futures
 168 support
 168 beat
 165 million
 165 est
 164 well
 164 business
 164 analysts
 163 looks
 163 gold
 162 morning
 162 ca
 161 chart
 160 look
 160 jobs
 160 beats
 159 share
 158 starbucks
 158 m
 157 gt
 156 me
 154 companies
 153 make
 152 only
 151 <num>.<num>m
 150 were
 149 data
 148 days
 147 world
 147 estimates
 146 target
 145 pivot
 143 cash
 142 before
 141 regn
 141 option
 140 alphabet
 139 ms
 138 misses
 138 lower
 138 against
 137 vs
 137 <num>m
 136 retail
 136 go
 136 cost
 136 calls
 135 money
 135 agn
 134 yahoo
 134 per
 133 really
 133 <num>.
 132 which
 132 huge
 132 hit
 132 his
 132 had
 132 crm
 132 cap
 132 alibaba
 132 -<num>
 131 need
 131 fit
 131 <num>k
 130 video
 130 know
 129 people
 127 revs
 127 results
 127 pay
 127 @timothysykes
 126 even
 126 analyst
 125 win
 125 vz
 125 strong
 125 put
 125 buying
 124 t
 122 run
 121 vix
 121 coming
 119 profit
 119 miss
 119 ebay
 119 biggest
 118 say
 118 @apple
 117 risk
 117 hours
 115 want
 115 uso
 115 under
 115 rally
 115 got
 114 've
 113 around
 113 america
 113 @jimcramer
 113 'll
 112 <num>c
 111 very
 111 tax
 111 far
 111 'm
 110 then
 110 them
 110 csx
 110 aal
 109 also
 109 <num>b
 108 sold
 108 many
 107 nice
 107 exxon
 107 bullish
 107 <num>th
 106 vxx
 105 strategy
 105 microsoft
 105 hold
 105 guidance
 104 while
 104 nearly
 104 dis
 104 dia
 103 worth
 103 valeant
 103 selling
 103 months
 103 fall
 102 |
 102 sachs
 102 read
 102 past
 102 @yahoofinance
 101 intel
 101 ever
 100 xlf
 100 wfc
 100 start
 100 friday
 100 any
  99 post
  98 said
  98 plans
  98 lot
  98 expect
  98 ago
  97 jack
  97 continues
  96 use
  95 small
  95 made
  95 cloud
  95 better
  95 banks
  94 open
  94 gets
  94 few
  94 @thestreet
  93 tomorrow
  93 keep
  93 ipo
  93 future
  93 find
  92 set
  92 +<num>.<num>
  91 work
  91 w/
  90 check
  90 celg
  90 capital
  89 wants
  89 looking
  89 key
  89 expectations
  88 wmt
  88 model
  88 love
  88 because
  87 end
  87 dal
  87 always
  86 where
  86 own
  86 latest
  85 same
  85 qualcomm
  85 despite
  85 closed
  84 luv
  84 less
  84 hard
  84 blog
  83 wfm
  83 users
  83 upside
  83 case
  83 bought
  83 ba
  83 <num>-<num>
  82 tv
  82 making
  82 gm
  82 @realdonaldtrump
  81 two
  81 numbers
  81 idea
  80 whole
  80 things
  80 snapchat
  80 prices
  80 fed
  80 buffett
  80 +
  79 nasdaq
  79 levels
  79 free
  79 early
  79 <num>/<num>
  78 rate
  78 nike
  78 needs
  78 near
  78 morgan
  78 might
  78 ea
  77 winner
  77 little
  77 gains
  77 every
  77 cheddarlive
  77 away
  76 sec
  76 list
  76 amgn
  76 amd
  75 those
  75 story
  75 plan
  75 outlook
  75 makes
  75 hits
  75 adbe
  75 =
  74 yelp
  74 wo
  74 ual
  74 raise
  74 ndx
  74 musk
  74 line
  74 fcx
  74 everyone
  74 @ophirgottlieb
  73 major
  73 investment
  73 gap
  73 financials
  73 fast
  73 f
  73 drop
  73 closing
  73 beating
  72 stanley
  72 sees
  72 resistance
  72 loss
  72 content
  72 app
  71 lead
  71 game
  71 -<num>.<num>
  70 returns
  70 media
  70 least
  70 fdx
  70 election
  70 almost
  70 @lamonicabuzz
  69 gdx
  69 cisco
  69 ad
  69 @jack
  68 u
  68 through
  68 taking
  68 real
  68 pypl
  68 president
  68 percent
  68 january
  68 history
  68 bad
  68 active
  67 tgt
  67 takes
  67 focus
  67 finally
  67 bear
  67 ban
  67 action
  66 value
  66 talk
  66 premarket
  66 help
  66 edge
  66 credit
  65 yet
  65 yes
  65 sure
  65 march
  65 interesting
  65 falls
  65 drug
  65 car
  65 bull
  65 being
  65 already
  64 war
  64 thanks
  64 policy
  64 mobile
  64 let
  64 cuts
  64 <num>day
  63 watching
  63 traders
  63 thing
  63 streak
  63 something
  63 negative
  63 month
  63 minutes
  63 fake
  63 come
  63 both
  63 ai
  63 <num>-year
  62 using
  62 spending
  62 learn
  62 largest
  62 give
  62 fitbit
  62 enough
  62 become
  61 study
  61 sector
  61 pretty
  61 impact
  61 immigration
  61 halted
  61 average
  60 verizon
  60 smart
  60 ge
  60 flat
  60 am
  60 adj
  60 @cnbc
  60 <num>q
  59 tim
  59 thursday
  59 thoughts
  59 push
  59 point
  59 part
  59 lol
  59 full
  59 fell
  59 exec
  59 energy
  59 axp
  59 @wsj
  59 @barronsonline
  58 three
  58 sale
  58 order
  58 lows
  58 cook
  58 change
  58 board
  57 weeks
  57 product
  57 missed
  57 mbly
  57 lvs
  57 bit
  57 @wallstjesus
  56 used
  56 ulta
  56 trying
  56 success
  56 red
  56 positive
  56 intraday
  56 cfo
  56 bell
  56 ackman
  56 account
  55 show
  55 services
  55 paypal
  55 likely
  55 interest
  55 important
  55 follow
  55 decline
  55 continue
  55 bill
  55 bigger
  55 between
  55 ads
  55 @seeitmarket
  54 uaa
  54 shareholder
  54 saying
  54 must
  54 maybe
  54 flow
  54 etf
  54 doing
  53 volume
  53 tillerson
  53 stake
  53 solid
  53 reason
  53 nothing
  53 mean
  53 daily
  53 bears
  53 adds
  53 aa
  53 @bfly
  52 wow
  52 winning
  52 total
  52 technology
  52 talking
  52 store
  52 rise
  52 points
  52 mixed
  52 ma
  52 level
  52 job
  52 holding
  52 customers
  52 american
  52 added
  51 update
  51 season
  51 problem
  51 index
  51 global
  51 @cmlviz
  50 wrong
  50 weak
  50 trader
  50 thinks
  50 stay
  50 peek
  50 others
  50 mu
  50 moves
  50 mark
  50 lost
  50 jnj
  50 innovation
  50 goes
  50 december
  50 cut
  50 bet
  50 ..
  49 tweets
  49 tweet
  49 straight
  49 stop
  49 service
  49 mrk
  49 longer
  49 long-term
  49 investing
  49 following
  49 downgrades
  49 done
  49 dollar
  49 among
  49 add
  48 working
  48 without
  48 warren
  48 stays
  48 started
  48 salesforce
  48 rev
  48 na
  48 industry
  48 gain
  48 fund
  48 estimate
  48 debt
  48 changes
  48 actually
  48 across
  47 ytd
  47 youtube
  47 worst
  47 tlt
  47 seems
  47 production
  47 possible
  47 momentum
  47 means
  47 head
  47 expects
  47 everything
  47 create
  47 assets
  47 activity
  47 @barronsasia
  46 w
  46 stores
  46 probe
  46 losing
  46 home
  46 growing
  46 gives
  46 elon
  46 <num>st
  45 winners
  45 travel
  45 talks
  45 sellers
  45 proposal
  45 play
  45 pcln
  45 online
  45 giving
  45 given
  45 financial
  45 failed
  45 caterpillar
  45 buys
  45 breakout
  45 auto
  45 asia
  44 worse
  44 user
  44 trades
  44 stuff
  44 shows
  44 seen
  44 recent
  44 reasons
  44 quarterly
  44 original
  44 hot
  44 hear
  44 economic
  44 citigroup
  43 wallstreet
  43 try
  43 tells
  43 soon
  43 platform
  43 meeting
  43 mar
  43 join
  43 invest
  43 highest
  43 hal
  43 february
  43 claims
  43 <num>/<num>/<num>
  42 yeah
  42 ups
  42 tuesday
  42 times
  42 swks
  42 strength
  42 research
  42 range
  42 puts
  42 pre-market
  42 needed
  42 matter
  42 life
  42 instagram
  42 hurt
  42 hate
  42 former
  42 discussed
  42 chinese
  42 @starbucks
  42 @riskreversal
  42 @cnnmoney
  41 zuckerberg
  41 ws
  41 wednesday
  41 uvxy
  41 rising
  41 public
  41 pricing
  41 office
  41 investor
  41 icymi
  41 half
  41 gas
  41 forecast
  41 feb
  41 during
  41 dead
  41 cvx
  41 costco
  41 competition
  41 cars
  41 bulls
  41 boost
  41 airlines
  41 @elonmusk
  41 @cnbcfastmoney
  40 within
  40 wait
  40 ubs
  40 ua
  40 turn
  40 st
  40 revenues
  40 reclaimed
  40 reality
  40 re
  40 names
  40 keeps
  40 hd
  40 foods
  40 executive
  40 europe
  40 downside
  40 discuss
  40 current
  40 cool
  40 compared
  40 charts
  40 breaks
  40 bounce
  40 believe
  40 avg
  40 @stocktwits
  40 <num>:<num>
  39 weekend
  39 ways
  39 warning
  39 unusual
  39 trillion
  39 running
  39 pro
  39 picks
  39 old
  39 oh
  39 leave
  39 happened
  39 gone
  39 explains
  39 else
  39 cycle
  39 cramer
  39 chief
  39 bwld
  39 betting
  39 anyone
  39 adding
  39 @amazon
  39 <num>-day
  38 trend
  38 traded
  38 she
  38 questions
  38 potential
  38 performance
  38 net
  38 moving
  38 management
  38 lots
  38 longest
  38 holiday
  38 bid
  38 bbry
  38 based
  38 airpods
  38 @megtirrell
  37 x
  37 went
  37 term
  37 spot
  37 slv
  37 single
  37 remember
  37 rates
  37 opportunity
  37 opening
  37 metrics
  37 launch
  37 health
  37 happens
  37 guess
  37 fight
  37 fear
  37 exactly
  37 due
  37 drops
  37 drive
  37 clear
  37 bidu
  37 @optionsaction
  37 @investopedia
  37 @biintelligence
  37 'd
  36 upgrades
  36 upgrade
  36 tough
  36 sells
  36 purchases
  36 number
  36 note
  36 losers
  36 john
  36 hedge
  36 downgrade
  36 dorsey
  36 dip
  36 digital
  36 bottom
  36 afternoon
  36 @cnbcclosingbell
  36 @canuck<num>usa
  35 xlk
  35 volatility
  35 upper
  35 took
  35 someone
  35 ready
  35 paying
  35 paid
  35 monday
  35 losses
  35 jan
  35 increase
  35 hope
  35 flag
  35 falling
  35 equity
  35 driving
  35 conference
  35 <num>x
  34 valuation
  34 sweepers
  34 shareholders
  34 return
  34 rating
  34 prime
  34 mat
  34 massive
  34 lose
  34 light
  34 led
  34 jumps
  34 industrials
  34 inauguration
  34 held
  34 government
  34 gave
  34 final
  34 crash
  34 cc
  34 break
  34 ath
  34 @lanceroberts
  34 @jonnajarian
  34 @facebook
  33 wrote
  33 weekly
  33 voo
  33 until
  33 uber
  33 thought
  33 team
  33 spreads
  33 save
  33 reporting
  33 pull
  33 power
  33 lessons
  33 later
  33 gpro
  33 gon
  33 face
  33 comp
  33 comments
  33 chance
  33 boeing
  33 biz
  33 @goldmansachs
  32 surge
  32 streaming
  32 starting
  32 social
  32 samsung
  32 raises
  32 q
  32 problems
  32 legal
  32 grow
  32 green
  32 fourth
  32 death
  32 consumer
  32 cbs
  32 calling
  32 appdynamics
  32 anything
  31 ~
  31 xle
  31 vol
  31 view
  31 track
  31 row
  31 question
  31 products
  31 pharma
  31 left
  31 internet
  31 eye
  31 effect
  31 easy
  31 customer
  31 attention
  31 ask
  31 @tim_cook
  31 @cheddar
  31 <num>ish
  31 +<num>.<num>m
  30 wonder
  30 whoa
  30 v
  30 trust
  30 trends
  30 test
  30 takeover
  30 smartphone
  30 sina
  30 seeing
  30 security
  30 rose
  30 profits
  30 mobil
  30 mgm
  30 lt
  30 law
  30 ko
  30 jnug
  30 issue
  30 inc
  30 hike
  30 engagement
  30 employees
  30 eem
  30 earlier
  30 disney
  30 cheap
  30 bonds
  30 bofa
  30 bearish
  30 avoid
  30 area
  30 approach
  30 amazing
  30 @cnbcnow
  30 @barronsnext
  29 wb
  29 vegas
  29 ung
  29 slightly
  29 search
  29 reported
  29 rebound
  29 private
  29 pick
  29 pfe
  29 partners
  29 orcl
  29 non-gaap
  29 night
  29 mostly
  29 inside
  29 increased
  29 holds
  29 forget
  29 dropped
  29 delivery
  29 d
  29 costs
  29 care
  29 behind
  29 armour
  29 alexa
  29 @charliebilello
  28 wings
  28 weakness
  28 tune
  28 though
  28 tell
  28 taxes
  28 surges
  28 stx
  28 shale
  28 second
  28 saw
  28 retailers
  28 release
  28 publishers
  28 powerful
  28 policies
  28 please
  28 ole
  28 never
  28 joke
  28 joins
  28 international
  28 indices
  28 india
  28 hire
  28 hansen
  28 firm
  28 fire
  28 exxonmobil
  28 et
  28 est.
  28 demand
  28 crazy
  28 coffee
  28 chat
  28 came
  28 blankfein
  28 amid
  28 agree
  28 @brianfires
  27 xli
  27 wen
  27 wedbush
  27 turns
  27 successful
  27 statement
  27 spread
  27 sny
  27 shorts
  27 position
  27 peak
  27 papa
  27 pace
  27 oott
  27 investigation
  27 inc.
  27 ibb
  27 hitting
  27 her
  27 forward
  27 economy
  27 donald
  27 diversity
  27 delta
  27 currently
  27 consecutive
  27 catch
  27 building
  27 bmy
  27 balance
  27 allergan
  27 aig
  27 adjusted
  27 @barronstechblog
  27 <num>-
  26 vr
  26 united
  26 understand
  26 terms
  26 such
  26 starts
  26 sq
  26 session
  26 sectors
  26 russell
  26 room
  26 reach
  26 quick
  26 prior
  26 preview
  26 premium
  26 monthly
  26 millionaire
  26 main
  26 jblu
  26 infrastructure
  26 him
  26 grew
  26 fun
  26 deliver
  26 crushed
  26 covered
  26 cmg
  26 bump
  26 bloomberg
  26 avgo
  26 atvi
  26 airline
  26 according
  26 ]
  26 [
  26 @sharatibken
  26 @reuters
  25 wynn
  25 warns
  25 unit
  25 threat
  25 testing
  25 spend
  25 sorry
  25 soars
  25 sjws
  25 rex
  25 rdr
  25 quarters
  25 pullback
  25 profitable
  25 probably
  25 positions
  25 music
  25 members
  25 matters
  25 kss
  25 james
  25 hardware
  25 guide
  25 gilead
  25 gary
  25 gaming
  25 funds
  25 forecasts
  25 favorite
  25 etc
  25 each
  25 drag
  25 cutting
  25 court
  25 consumers
  25 co
  25 chicken
  25 buffalo
  25 bond
  25 affect
  25 advertising
  25 acquisition
  25 @twitter
  25 @jbooton
  25 @halftimereport
  24 yoy
  24 worried
  24 wild
  24 welcome
  24 traffic
  24 third
  24 supply
  24 super
  24 steps
  24 step
  24 solarcity
  24 size
  24 sign
  24 series
  24 rises
  24 ride
  24 reportedly
  24 remains
  24 quote
  24 pt
  24 pm
  24 penny
  24 papas
  24 near-term
  24 mkt
  24 mattel
  24 lawsuit
  24 las
  24 killing
  24 khc
  24 iphones
  24 hum
  24 heading
  24 happy
  24 handles
  24 giant
  24 expiry
  24 etfs
  24 development
  24 deutsche
  24 ddd
  24 cmcsa
  24 charge
  24 center
  24 called
  24 broke
  24 baristas
  24 answer
  24 after-hours
  24 @businessinsider
  24 @<num>capital
  24 <num>.<num>ish
  24 <num>-week
  23 walmart
  23 unh
  23 tmus
  23 taken
  23 subscribers
  23 stories
  23 stockalert
  23 steve
  23 spls
  23 solar
  23 sne
  23 shipping
  23 sentiment
  23 sense
  23 scoop
  23 sands
  23 rules
  23 powered
  23 overall
  23 nugt
  23 mobileye
  23 language
  23 lack
  23 jump
  23 impressive
  23 htz
  23 htt
  23 ht
  23 having
  23 guy
  23 gained
  23 five
  23 feed
  23 fang
  23 fact
  23 faces
  23 execs
  23 exclusive
  23 dragonfly
  23 devices
  23 delivered
  23 dax
  23 closes
  23 calendar
  23 buybacks
  23 bubble
  23 becoming
  23 autonomous
  23 apps
  23 announced
  23 amat
  23 @foxbusiness
  23 @bankofamerica
  23 <num>-month
  23 *
  22 yum
  22 workers
  22 wins
  22 waiting
  22 turnaround
  22 trim
  22 tops
  22 teva
  22 terrible
  22 targets
  22 suffer
  22 stupid
  22 square
  22 software
  22 sick
  22 risks
  22 refugees
  22 pre-mkt
  22 poor
  22 poised
  22 nyse
  22 nxpi
  22 micron
  22 labor
  22 jim
  22 investools
  22 house
  22 h
  22 ftse
  22 ffiv
  22 fair
  22 era
  22 environment
  22 employee
  22 dollars
  22 dividend
  22 different
  22 delayed
  22 decision
  22 crisis
  22 concerns
  22 cnbc
  22 closer
  22 ceos
  22 build
  22 bringing
  22 breadth
  22 box
  22 blackberry
  22 beyond
  22 april
  22 agrees
  22 abc
  22 @netflix
  22 @adamfeuerstein
  22 'sell
  21 web
  21 wdc
  21 views
  21 touch
  21 told
  21 surprised
  21 spent
  21 space
  21 slump
  21 side
  21 shopping
  21 sheet
  21 road
  21 review
  21 rest
  21 reform
  21 race
  21 putting
  21 posted
  21 political
  21 place
  21 overvalued
  21 nvs
  21 nasdaq-<num>
  21 missing
  21 lowest
  21 lmt
  21 likes
  21 lg
  21 leadership
  21 large
  21 hpq
  21 hlf
  21 heavy
  21 headed
  21 happening
  21 happen
  21 golive
  21 goal
  21 further
  21 found
  21 expands
  21 electric
  21 double
  21 dnkn
  21 dj
  21 cos
  21 compensation
  21 citi
  21 century
  21 bonus
  21 base
  21 bankers
  21 appear
  21 although
  21 @wholefoods
  21 @stockstotrade
  21 @seanansmith
  21 @michael_khouw
  21 @forbes
  21 @defotis
  21 @angiemiles
  21 <num>.<num>bn
  21 '<num>
  20 ~<num>
  20 worked
  20 whatsapp
  20 wells
  20 vulnerable
  20 union
  20 turned
  20 thru
  20 surprise
  20 simple
  20 seem
  20 rival
  20 ratio
  20 quite
  20 pressure
  20 popular
  20 plus
  20 peeps
  20 pattern
  20 patents
  20 patent
  20 party
  20 once
  20 nomura
  20 mission
  20 mass
  20 marketing
  20 longs
  20 learning
  20 leading
  20 l
  20 knows
  20 kate
  20 itself
  20 incredible
  20 including
  20 ideas
  20 hour
  20 hiring
  20 healthcare
  20 guys
  20 group
  20 gigafactory
  20 food
  20 feel
  20 feature
  20 eyes
  20 echo
  20 e-commerce
  20 deliveries
  20 de
  20 damages
  20 core
  20 cohn
  20 chk
  20 cautious
  20 buyers
  20 brand
  20 blue
  20 bitcoin
  20 biotech
  20 bets
  20 bernstein
  20 begins
  20 basis
  20 anet
  20 analysis
  20 @qualcomm
  20 @markets
  20 <num>+
  19 word
  19 wealth
  19 warned
  19 wal-mart
  19 vehicles
  19 vehicle
  19 unp
  19 transaction
  19 tonight
  19 tobeapartner
  19 ties
  19 technical
  19 subscriber
  19 soar
  19 six
  19 siri
  19 signals
  19 sig
  19 setting
  19 serious
  19 seconds
  19 rumors
  19 retailer
  19 quietly
  19 priced
  19 prgo
  19 pre
  19 post-earnings
  19 podcast
  19 piece
  19 pg
  19 owns
  19 owning
  19 outperform
  19 mln
  19 mind
  19 millions
  19 machine
  19 len
  19 late
  19 inflation
  19 hidden
  19 helped
  19 fail
  19 factory
  19 facilities
  19 ends
  19 ended
  19 don
  19 disappointing
  19 date
  19 corporate
  19 charobs
  19 chain
  19 campaign
  19 bring
  19 aws
  19 autopilot
  19 analyst_<num>
  19 altaba
  19 advantage
  19 adobe
  19 @estimize
  19 @caterpillarinc
  19 @benzinga
  18 weighs
  18 visual
  18 upgraded
  18 twx
  18 turning
  18 trending
  18 toward
  18 survey
  18 surprising
  18 squeeze
  18 speech
  18 signal
  18 shld
  18 same-store
  18 rule
  18 remain
  18 recently
  18 r
  18 qsr
  18 purchase
  18 portfolio
  18 plunges
  18 plunge
  18 phone
  18 personal
  18 overbought
  18 orders
  18 ok
  18 monetize
  18 manager
  18 lloyd
  18 leaving
  18 june
  18 jobless
  18 issues
  18 ipad
  18 invested
  18 income
  18 hpe
  18 hikes
  18 helps
  18 futs
  18 freeport-mcmoran
  18 force
  18 feels
  18 fdic
  18 entered
  18 either
  18 drugs
  18 downgraded
  18 decade
  18 deals
  18 competitive
  18 commodities
  18 commitment
  18 comes
  18 bust
  18 businesses
  18 blame
  18 bby
  18 b
  18 awesome
  18 antm
  18 accounts
  18 @jeffmacke
  18 @cnntech
  18 <num>bn
  18 /
  17 yrs
  17 xrt
  17 workforce
  17 won
  17 weather
  17 virtual
  17 utx
  17 upcoming
  17 trip
  17 threats
  17 thank
  17 student
  17 sports
  17 skew
  17 sitting
  17 sinks
  17 simply
  17 shot
  17 sessions
  17 seller
  17 sell-off
  17 sarcasm
  17 sandberg
  17 ruling
  17 returned
  17 refine
  17 records
  17 rbc
  17 rather
  17 raised
  17 provide
  17 project
  17 player
  17 pivots
  17 pe
  17 parts
  17 oracle
  17 nominee
  17 networks
  17 moynihan
  17 movers
  17 mess
  17 marriott
  17 man
  17 loses
  17 leaders
  17 keeping
  17 jason
  17 ignore
  17 icahn
  17 hey
  17 gale
  17 fxi
  17 fully
  17 fred
  17 fourth-quarter
  17 forever
  17 foreign
  17 fiscal
  17 fintech
  17 finance
  17 faster
  17 fargo
  17 fabric
  17 experts
  17 ev
  17 entire
  17 dozen
  17 definitely
  17 dec
  17 cp
  17 copper
  17 confidence
  17 chip
  17 cares
  17 battery
  17 banking
  17 andrew
  17 alert
  17 air
  17 @nickbilton
  17 @kchaykowski
  17 @howardlindzon
  17 @hedgeye
  17 @<num>
  16 ya
  16 wsj
  16 weigh
  16 waymo
  16 true
  16 trimmed
  16 together
  16 tencent
  16 ten
  16 supplier
  16 struggle
  16 stopped
  16 stepping
  16 slow
  16 showing
  16 shift
  16 sent
  16 sat
  16 reversal
  16 reuters
  16 reinstatejulia
  16 protected
  16 produce
  16 press
  16 present
  16 playing
  16 perspective
  16 pending
  16 paul
  16 path
  16 pacific
  16 ouch
  16 operating
  16 nsc
  16 name
  16 mro
  16 margins
  16 leader
  16 jcp
  16 island
  16 interview
  16 infographic
  16 info
  16 hon
  16 fresh
  16 fine
  16 fate
  16 except
  16 example
  16 error
  16 economist
  16 dude
  16 discussion
  16 disaster
  16 deregulation
  16 cover
  16 cot
  16 continuation
  16 considering
  16 congrats
  16 confirms
  16 complete
  16 club
  16 clients
  16 cia
  16 cents
  16 cent
  16 carl
  16 bs
  16 broken
  16 booming
  16 blow
  16 began
  16 beautiful
  16 bbby
  16 available
  16 asking
  16 arrows
  16 appeal
  16 anymore
  16 announces
  16 anniversary
  16 amount
  16 age
  16 absolutely
  16 @richbtig
  16 @mcwm
  16 @ft
  16 @alex
  16 <num>s
  16 <num>nd
  15 xly
  15 wish
  15 wanted
  15 wan
  15 vote
  15 videos
  15 valley
  15 uup
  15 unfairly
  15 tries
  15 treasury
  15 thurs
  15 th
  15 terminated
  15 ta
  15 stream
  15 strangle
  15 steady
  15 staples
  15 stands
  15 srpt
  15 spots
  15 speaking
  15 site
  15 silver
  15 shop
  15 shak
  15 science
  15 saxostrats
  15 rumor
  15 react
  15 rad
  15 protection
  15 pop
  15 plug
  15 pfizer
  15 permian
  15 patients
  15 partnership
  15 officer
  15 ntes
  15 nears
  15 mon
  15 minute
  15 merger
  15 mayer
  15 material
  15 manufacturing
  15 manage
  15 listen
  15 link
  15 leaves
  15 lagged
  15 kind
  15 jpmorgan
  15 joining
  15 joe
  15 inline
  15 indexes
  15 imho
  15 hopes
  15 highlights
  15 fslr
  15 front
  15 form
  15 filing
  15 fakenews
  15 expansion
  15 exit
  15 equities
  15 enjoy
  15 employer
  15 emergingmarkets
  15 domestic
  15 discusses
  15 digits
  15 describes
  15 deck
  15 davos
  15 competitors
  15 celgene
  15 careful
  15 built
  15 brexit
  15 boy
  15 benefit
  15 aim
  15 agreement
  15 advisor
  15 @squawkalley
  15 @retheauditors
  15 @potus
  15 @philipvandoorn
  15 @nyse
  15 @mcdonalds
  15 @marketwatch
  15 @jowens<num>
  15 @factset
  15 @exxonmobil
  15 @davidgzeiler
  15 @bloomberg
  15 'super
  14 y/y
  14 xlv
  14 xbi
  14 white
  14 vision
  14 valuations
  14 units
  14 tips
  14 thinking
  14 state
  14 sounds
  14 slw
  14 sliding
  14 silicon
  14 signs
  14 significant
  14 shh
  14 sets
  14 september
  14 scary
  14 russia
  14 rotation
  14 robots
  14 regulators
  14 recap
  14 recall
  14 reading
  14 rarely
  14 pzza
  14 pushed
  14 promises
  14 profitability
  14 praluent
  14 pnra
  14 pile
  14 pershing
  14 performed
  14 paper
  14 optimism
  14 oled
  14 ol
  14 notes
  14 momo
  14 mistakes
  14 millennials
  14 mexico
  14 membership
  14 member
  14 mask
  14 macy
  14 limited
  14 launches
  14 king
  14 journalism
  14 jets
  14 instead
  14 insight
  14 increases
  14 host
  14 himx
  14 helping
  14 hell
  14 hearing
  14 harrison
  14 halliburton
  14 giants
  14 ges
  14 folks
  14 fixed
  14 figure
  14 fading
  14 factor
  14 extended
  14 expiration
  14 expensive
  14 eu
  14 entry
  14 enforcement
  14 effort
  14 doubt
  14 dks
  14 direction
  14 die
  14 dept
  14 denies
  14 crushes
  14 correction
  14 convo
  14 control
  14 constructive
  14 confirmed
  14 concerned
  14 comps
  14 compare
  14 clearly
  14 changed
  14 card
  14 btw
  14 bln
  14 battle
  14 baidu
  14 baby
  14 augmented
  14 amgen
  14 alcoa
  14 actual
  14 acquisitions
  14 @youtube
  14 @teslamotors
  14 @technology
  14 @russellrhoads
  14 @maxnisen
  14 @matthewherper
  14 @ericjhonsa
  14 @bloombergtv
  14 <num>,<num>.<num>
  13 xlb
  13 wireless
  13 versus
  13 usd
  13 unveils
  13 undisclosed
  13 twlo
  13 tsco
  13 troll
  13 traditional
  13 talked
  13 talent
  13 taiwan
  13 system
  13 suisse
  13 students
  13 stuck
  13 storage
  13 steel
  13 stage
  13 staff
  13 spike
  13 smartphones
  13 sends
  13 searched
  13 screw
  13 schultz
  13 retirement
  13 restaurants
  13 responds
  13 reserve
  13 reminder
  13 recovery
  13 reaction
  13 quiet
  13 qtr
  13 pulls
  13 process
  13 prepares
  13 potentially
  13 posts
  13 poll
  13 period
  13 percentage
  13 partner
  13 nikkei
  13 neutral
  13 natural
  13 munster
  13 moment
  13 mnkd
  13 mgmt
  13 mention
  13 measure
  13 meaningful
  13 mdlz
  13 mackey
  13 macau
  13 lifts
  13 larger
  13 kr
  13 joined
  13 irish
  13 injunction
  13 hunter
  13 flattish
  13 firms
  13 filings
  13 fedex
  13 fda
  13 favor
  13 fan
  13 express
  13 exposure
  13 experience
  13 expecting
  13 exits
  13 execution
  13 excellent
  13 event
  13 east
  13 easily
  13 details
  13 coo
  13 contrary
  13 comeback
  13 combat
  13 cml
  13 cleared
  13 city
  13 channel
  13 challenges
  13 caused
  13 cause
  13 caps
  13 canadian
  13 bye
  13 brian
  13 brands
  13 border
  13 boom
  13 blowout
  13 beauty
  13 battlefield
  13 arista
  13 annual
  13 announcement
  13 all-day
  13 addyy
  13 activist
  13 able
  13 abbv
  13 @theiphawk
  13 @squawkcnbc
  13 @reformedbroker
  13 @pavelsenor
  13 @markyusko
  13 @katekelly
  13 @hedgeyeindstrls
  13 @hedgeyehwp
  13 @google
  13 @callum_thomas
  13 <num>pm
  13 -<num>c
  12 yr
  12 xbt
  12 woods
  12 wolf
  12 wiseguys
  12 window
  12 valuable
  12 unchanged
  12 tumble
  12 topped
  12 tho
  12 theory
  12 tape
  12 tanks
  12 suit
  12 suddenly
  12 suck
  12 stt
  12 stockmarket
  12 standalone
  12 speak
  12 shanghai+.<num>
  12 seriously
  12 scty
  12 sad
  12 rumored
  12 rolled
  12 role
  12 reward
  12 retreat
  12 replaced
  12 releases
  12 released
  12 reiterates
  12 regeneron
  12 reexamine
  12 reduce
  12 reclaim
  12 quit
  12 publish
  12 proud
  12 profile
  12 pixel
  12 pipeline
  12 pep
  12 pays
  12 parental
  12 panw
  12 p/e
  12 orly
  12 oct
  12 nope
  12 noble
  12 nafta
  12 mode
  12 meta
  12 meets
  12 mcdonalds
  12 mac
  12 lookin
  12 linked
  12 lags
  12 kid
  12 johnson
  12 information
  12 increasing
  12 import
  12 illinois
  12 hk+.<num>
  12 headlines
  12 globally
  12 glad
  12 girlfriend
  12 fyi
  12 friends
  12 foxconn
  12 fox
  12 four
  12 flight
  12 finds
  12 filled
  12 felt
  12 feds
  12 family
  12 expert
  12 expe
  12 euro
  12 equivalent
  12 equal
  12 entering
  12 em
  12 egg
  12 eat
  12 dpx
  12 doomed
  12 dividends
  12 directors
  12 detailed
  12 defends
  12 declining
  12 declined
  12 dax-.<num>
  12 crus
  12 crb
  12 cowen
  12 countries
  12 compete
  12 comparable
  12 community
  12 commentary
  12 coh
  12 climate
  12 chkp
  12 challenge
  12 catalysts
  12 candle
  12 cac-.<num>
  12 buyout
  12 brings
  12 breakfast
  12 breaches
  12 bp
  12 boring
  12 blk
  12 berkshire
  12 believes
  12 bbt
  12 barron
  12 azo
  12 attorney
  12 asks
  12 asked
  12 arnc
  12 aggressively
  12 affected
  12 aet
  12 abx
  12 @ukarlewitz
  12 @scottbudman
  12 @nypost
  12 @kantar
  12 @jamesliamcook
  12 @cfojournal
  12 @brentlsaunders
  12 @barrons
  12 @alexistvnews
  12 @adamsinger
  12 <num>/share
  12 <num>/n
  11 zuck
  11 zero
  11 yourself
  11 york
  11 wix
  11 wider
  11 volatile
  11 usually
  11 unless
  11 ultimately
  11 ugly
  11 type
  11 truth
  11 tool
  11 tone
  11 tm
  11 tlrd
  11 timing
  11 timeline
  11 tight
  11 ticker
  11 throws
  11 tactical
  11 syna
  11 swing
  11 surging
  11 suggest
  11 sued
  11 subway
  11 style
  11 straddle
  11 stealth
  11 stand
  11 sss
  11 sprint
  11 specifics
  11 source
  11 sound
  11 sometimes
  11 soft
  11 smaller
  11 slowing
  11 slide
  11 skyworks
  11 shut
  11 short-term
  11 shkreli
  11 shines
  11 shake
  11 send
  11 self-driving
  11 segments
  11 securities
  11 secretary
  11 scared
  11 saudi
  11 rsi
  11 roll
  11 risen
  11 ridiculous
  11 rich
  11 renaissance
  11 reference
  11 reached
  11 raid
  11 pwc
  11 pulling
  11 protect
  11 programs
  11 predicted
  11 positioned
  11 platforms
  11 plant
  11 picture
  11 perform
  11 payments
  11 parent
  11 pandora
  11 page
  11 otherwise
  11 offering
  11 oclr
  11 nus
  11 nbc
  11 mpel
  11 motors
  11 middle
  11 met
  11 menu
  11 meet
  11 margin
  11 managed
  11 maker
  11 mad
  11 leads
  11 lately
  11 laid
  11 known
  11 julia
  11 jjc
  11 influence
  11 incy
  11 hottest
  11 hopefully
  11 historic
  11 heard
  11 hain
  11 habits
  11 grc
  11 goose
  11 fundamental
  11 full-time
  11 foxa
  11 flying
  11 fizzles
  11 fill
  11 figures
  11 fees
  11 federal
  11 fails
  11 facing
  11 equipment
  11 endp
  11 emperor
  11 emergingmarket
  11 efforts
  11 edit
  11 earth
  11 dpz
  11 donations
  11 discount
  11 disclosure
  11 discloses
  11 disappoint
  11 departure
  11 delivers
  11 david
  11 cyber
  11 curb
  11 created
  11 coverage
  11 country
  11 corporation
  11 continued
  11 congress
  11 confused
  11 concern
  11 communications
  11 common
  11 comment
  11 cmlviztm
  11 clf
  11 class
  11 chips
  11 capitalize
  11 butterfly
  11 bunch
  11 bulk
  11 boycottstarbucks
  11 boycott
  11 bowl
  11 boosts
  11 black
  11 benzinga
  11 benchmark
  11 basically
  11 barely
  11 badly
  11 avp
  11 associated
  11 amc
  11 ag
  11 advice
  11 advanced
  11 administration
  11 adi
  11 address
  11 act
  11 acquired
  11 accelerated
  11 aap
  11 @wsjmoneybeat
  11 @tomikilgore
  11 @microsoft
  11 @gigabarb
  11 @ernestscheyder
  11 @bnn
  11 @biuk_tech
  11 @bespokeinvest
  11 @andybiotech
  11 <num>d
  11 +<num>,<num>
  10 yikes
  10 yellen
  10 wiseguy
  10 wing
  10 wheeler
  10 watson
  10 watchlist
  10 washington
  10 voice
  10 vale
  10 vaguely
  10 urbn
  10 upon
  10 updated
  10 unlikely
  10 twice
  10 trouble
  10 transgender
  10 trail
  10 tpp
  10 title
  10 tires
  10 thousands
  10 territory
  10 terrific
  10 taught
  10 tap
  10 systems
  10 survive
  10 supports
  10 suing
  10 struggles
  10 strategies
  10 star
  10 spoke
  10 split
  10 spade
  10 sniper
  10 smoke
  10 slowest
  10 skeptics
  10 sight
  10 shutter
  10 shorted
  10 sheryl
  10 shadow
  10 seinfeld
  10 seeks
  10 seek
  10 scrutiny
  10 scale
  10 satya
  10 sanctions
  10 roundtable
  10 roughly
  10 repeats
  10 repatriation
  10 recommend
  10 rare
  10 rallying
  10 quickly
  10 proof
  10 promising
  10 projected
  10 program
  10 privacy
  10 print
  10 previous
  10 pr
  10 police
  10 plays
  10 perhaps
  10 pc
  10 pair
  10 oil-equivalent
  10 obv
  10 nuts
  10 networking
  10 needle
  10 natgas
  10 najarian
  10 mystery
  10 moved
  10 monster
  10 mjn
  10 miners
  10 min
  10 messenger
  10 memory
  10 meh
  10 measured
  10 meant
  10 martin
  10 macro
  10 loved
  10 looms
  10 linkedin
  10 lines
  10 lesson
  10 layoffs
  10 july
  10 judgement
  10 judge
  10 jeff
  10 japan
  10 issued
  10 isrg
  10 ios
  10 investigating
  10 inventory
  10 improving
  10 impossible
  10 ilmn
  10 huh
  10 hq
  10 hint
  10 heat
  10 headwinds
  10 hackers
  10 hacked
  10 gorman
  10 goldmansachs
  10 gc_f
  10 gate
  10 french
  10 freeport
  10 fortune
  10 fears
  10 fcau
  10 fastest
  10 factset
  10 exp
  10 excuse
  10 excited
  10 eni
  10 employment
  10 eddie
  10 earned
  10 dust
  10 dummy
  10 dropping
  10 drones
  10 dominate
  10 diverse
  10 dive
  10 ditched
  10 distraction
  10 disagreeing
  10 disagree
  10 dg
  10 developers
  10 deposits
  10 demo
  10 deltaoutage
  10 delays
  10 declines
  10 debate
  10 dash
  10 crude
  10 crucial
  10 crowded
  10 corp.
  10 confirmation
  10 components
  10 comparison
  10 comical
  10 clip
  10 cholesterol
  10 charging
  10 ces
  10 central
  10 ccl
  10 caught
  10 catalyst
  10 bug
  10 brilliant
  10 bridge
  10 breakdown
  10 book
  10 beware
  10 benefits
  10 bag
  10 audit
  10 at-the-money
  10 asap
  10 arcuri
  10 apparel
  10 anywhere
  10 antitrust
  10 alternative
  10 along
  10 ally
  10 ahahahaha
  10 admits
  10 acquire
  10 accurate
  10 @vfhive
  10 @usatoday
  10 @snapchat
  10 @shonaghosh
  10 @sanglucci
  10 @rorol
  10 @recode
  10 @powerlunch
  10 @nytimes
  10 @nike
  10 @morganstanley
  10 @mktsinsider
  10 @hedgeyeretail
  10 @guyadami
  10 @gilliantan
  10 @business
  10 @anshelsag
  10 @adamlashinsky
  10 @<num>mstockgame
  10 <num>-yr
  10 'em
   9 zone
   9 zltq
   9 young
   9 year-over-year
   9 wti
   9 written
   9 worry
   9 women
   9 willing
   9 whr
   9 whose
   9 western
   9 wed
   9 watt
   9 walking
   9 wake
   9 violent
   9 verdict
   9 venmo
   9 unionizer
   9 tza
   9 txn
   9 tue
   9 truly
   9 toy
   9 towards
   9 toshiba
   9 till
   9 tied
   9 thrilling
   9 tbt
   9 subs
   9 softbank
   9 slowdown
   9 skin
   9 shit
   9 sharing
   9 several
   9 seeking
   9 schw
   9 rough
   9 rip
   9 reviews
   9 reviewing
   9 reverse
   9 result
   9 relatively
   9 rejected
   9 regulatory
   9 recession
   9 rai
   9 pushing
   9 price-target
   9 previews
   9 predicts
   9 posting
   9 pnc
   9 pledges
   9 planning
   9 piper
   9 philanthropy
   9 patient
   9 passed
   9 overseas
   9 overdone
   9 outage
   9 opened
   9 opec
   9 ntdoy
   9 normal
   9 none
   9 nominated
   9 noise
   9 neutrality
   9 national
   9 nadella
   9 mysterious
   9 murder
   9 models
   9 mm
   9 mining
   9 midday
   9 mid
   9 mgi
   9 macbook
   9 loves
   9 looked
   9 local
   9 load
   9 listening
   9 lik
   9 legs
   9 legit
   9 lb
   9 lawyer
   9 launching
   9 landscape
   9 kitchens
   9 kinda
   9 killer
   9 kids
   9 kicks
   9 jd
   9 item
   9 irony
   9 ipos
   9 iot
   9 investments
   9 insurance
   9 ino
   9 initial
   9 industrial
   9 indicator
   9 increasingly
   9 improve
   9 impressed
   9 i.e
   9 households
   9 hotel
   9 hoping
   9 hollywood
   9 hog
   9 hired
   9 helpful
   9 healthy
   9 h/t
   9 grub
   9 goods
   9 gloomy
   9 gigantic
   9 generated
   9 gdp
   9 fy
   9 futs-<num>
   9 fraud
   9 franchisees
   9 foot
   9 fomc
   9 feye
   9 features
   9 fascinating
   9 fantastic
   9 fans
   9 expanding
   9 execute
   9 espr
   9 es_f
   9 entirely
   9 enthusiasm
   9 enter
   9 emc
   9 economists
   9 drys
   9 driverless
   9 downward
   9 doubled
   9 domino
   9 dodd-frank
   9 docs
   9 divergence
   9 disclosing
   9 dgaz
   9 device
   9 deposit
   9 deeply
   9 debut
   9 dax+.<num>
   9 cvs
   9 cree
   9 creating
   9 count
   9 completely
   9 committed
   9 combined
   9 coke
   9 climbs
   9 chowdhry
   9 chipotle
   9 chatter
   9 career
   9 canceled
   9 btc
   9 broadcom
   9 blow-off
   9 bil
   9 bezos
   9 becomes
   9 bb
   9 backing
   9 b/c
   9 awful
   9 attacks
   9 atm
   9 assistance
   9 arts
   9 article
   9 aria
   9 argue
   9 ar
   9 announcing
   9 announce
   9 android
   9 amrn
   9 algorithm
   9 aggressive
   9 adidas
   9 accounting
   9 acceleration
   9 accelerating
   9 abt
   9 @slangwise
   9 @shuli_ren
   9 @rickjnewman
   9 @readdanwrite
   9 @msabalakrishnan
   9 @marknewtoncmt
   9 @marketplace
   9 @marcus
   9 @lebeaucarnews
   9 @cecileva
   9 @anthonynoto
   9 @americanair
   9 @adambain
   9 <num>rd
   9 <num>/
   9 //
   9 'this
   9 'the
   8 zts
   8 zion
   8 yuge
   8 xop
   8 wu
   8 writes
   8 write
   8 words
   8 withdrawal
   8 winterstormstella
   8 whether
   8 waste
   8 wages
   8 w/o
   8 vwap
   8 volumes
   8 viewing
   8 victim
   8 vi
   8 vertical
   8 ve
   8 v.
   8 useful
   8 underlying
   8 uncertainty
   8 ugaz
   8 uaw
   8 ttwo
   8 trv
   8 trumps
   8 tree
   8 tran
   8 trailing
   8 tracking
   8 towel
   8 tour
   8 thefinalyolo
   8 texas
   8 tad
   8 sweet
   8 surged
   8 superbowl
   8 summit
   8 stronger
   8 stellar
   8 steam
   8 startup
   8 ssnlf
   8 spotlight
   8 specifically
   8 sonar
   8 solve
   8 soaring
   8 slows
   8 skx
   8 shortly
   8 shipments
   8 sharpies
   8 sfm
   8 serving
   8 server
   8 sept
   8 semiconductor
   8 secure
   8 secstate
   8 secret
   8 screens
   8 savings
   8 safe
   8 s.
   8 rut
   8 rl
   8 risky
   8 ripping
   8 revolution
   8 retest
   8 restrictions
   8 resign
   8 remarkable
   8 remaining
   8 radio
   8 qualified
   8 quadrupled
   8 publishes
   8 psx
   8 proxy
   8 prove
   8 prospects
   8 proper
   8 progress
   8 presentation
   8 prepared
   8 pot
   8 pops
   8 plenty
   8 pie
   8 pharmaceuticals
   8 person
   8 peoria
   8 payout
   8 org
   8 opposite
   8 oppenheimer
   8 operations
   8 opens
   8 op
   8 offers
   8 offer
   8 oculus
   8 october
   8 nikkei-<num>.<num>
   8 newest
   8 netease
   8 nearing
   8 nbl
   8 nailed
   8 myl
   8 mx
   8 mozambique
   8 mortgage
   8 modest
   8 mistake
   8 mis-pricing
   8 millionaires
   8 micro
   8 michael
   8 message
   8 mentioned
   8 melt
   8 mega
   8 match
   8 manufacture
   8 lucky
   8 lowers
   8 login
   8 locations
   8 lng
   8 lies
   8 lets
   8 land
   8 knew
   8 kiplinger
   8 kills
   8 kill
   8 kidding
   8 keys
   8 kelly
   8 juno
   8 jeopardy
   8 jar
   8 j
   8 ipads
   8 intact
   8 inspired
   8 insights
   8 innovate
   8 imagine
   8 human
   8 hsy
   8 hrs
   8 hpt
   8 honest
   8 hod
   8 historically
   8 hence
   8 hcv
   8 hbo
   8 hardest
   8 hall
   8 hack
   8 grand
   8 graham
   8 golf
   8 gk
   8 gift
   8 gettin
   8 gene
   8 gdxj
   8 focuses
   8 floor
   8 fix
   8 finish
   8 fewer
   8 fairly
   8 fade
   8 extremely
   8 expense
   8 excluded
   8 exciting
   8 exceeded
   8 exceed
   8 etsy
   8 esrx
   8 especially
   8 esg
   8 er
   8 engineers
   8 emerging
   8 email
   8 electronic
   8 el
   8 economics
   8 ecommerce
   8 dsw
   8 drone
   8 drifts
   8 dream
   8 dna
   8 dix
   8 disrupt
   8 disclosures
   8 disagreement
   8 directly
   8 diluted
   8 digesting
   8 difficult
   8 didn
   8 dick
   8 descending
   8 department
   8 def
   8 dad
   8 cybersecurity
   8 crying
   8 credibility
   8 creates
   8 crashes
   8 craig
   8 courtesy
   8 couple
   8 corrected
   8 correct
   8 conspiracy
   8 consolidation
   8 conflict
   8 commodity
   8 commerce
   8 commented
   8 co.
   8 climbing
   8 clayton
   8 cien
   8 cheaper
   8 changing
   8 challenging
   8 chair
   8 cell
   8 carter
   8 cannabis
   8 cancer
   8 cake
   8 buzz
   8 buyer
   8 broad
   8 brk.b
   8 brk
   8 blocking
   8 blockbuster
   8 bizarre
   8 billionaire
   8 begin
   8 basics
   8 baird
   8 back-tests
   8 awards
   8 ausbiz
   8 assuming
   8 assume
   8 ass
   8 askwarren
   8 approval
   8 appears
   8 api
   8 analytics
   8 amex
   8 alxn
   8 alk
   8 aka
   8 affiliate
   8 adviser
   8 addition
   8 access
   8 accelerate
   8 abuse
   8 @zerofiltertruth
   8 @warrenbuffett
   8 @valaafshar
   8 @themotleyfool
   8 @thebubblebubble
   8 @srussolillo
   8 @squawkstreet
   8 @simonettilauren
   8 @shiraovide
   8 @selerity
   8 @scottwapnercnbc
   8 @options
   8 @newsmax
   8 @mylesudland
   8 @markarbeter
   8 @linnaneciara
   8 @liamdenning
   8 @lawandloubs
   8 @filmprofessor<num>
   8 @fedex
   8 @deoneroberts
   8 @corytv
   8 @cnet
   8 @chamath
   8 @cerebrus<num>
   8 @carlquintanilla
   8 <num>yr
   8 <num>-<num>.
   8 .<num>
   7 zn_f
   7 zb_f
   7 yield
   7 y
   7 xrx
   7 worries
   7 weight
   7 website
   7 wcu
   7 wba
   7 wayyyy
   7 water
   7 warrants
   7 warner
   7 warn
   7 w/out
   7 visa
   7 viab
   7 vague
   7 usual
   7 uri
   7 ur
   7 updates
   7 upbeat
   7 unpaid
   7 unicorn
   7 udn
   7 u.s.-china
   7 tx
   7 tues
   7 tricky
   7 tremendous
   7 totally
   7 tnx
   7 tick
   7 throwing
   7 thrilled
   7 three-years
   7 teeth
   7 taste
   7 tarullo
   7 takeaways
   7 table
   7 sustainable
   7 surface
   7 suppliers
   7 sub
   7 stupidstock
   7 structure
   7 streetaccount
   7 strategic
   7 straddles
   7 stock-based
   7 stm
   7 standout
   7 sqqq
   7 spokesman
   7 splk
   7 spin
   7 special
   7 spdr
   7 smartwatches
   7 slowly
   7 sleep
   7 slam
   7 sit
   7 similar
   7 silly
   7 shorting
   7 seven
   7 setup
   7 servers
   7 seq
   7 seemed
   7 scott
   7 salix
   7 rush
   7 runs
   7 ruined
   7 rsx
   7 round
   7 roof
   7 rolls
   7 rollback
   7 rock
   7 ring
   7 response
   7 requiring
   7 recently-released
   7 reaches
   7 rdsa
   7 quotes
   7 questionable
   7 published
   7 provided
   7 proved
   7 proposed
   7 priceline
   7 previously
   7 presidency
   7 presenting
   7 post-election
   7 portion
   7 pointing
   7 players
   7 pitch
   7 pictures
   7 picking
   7 photo
   7 penalty
   7 peaceful
   7 pcs
   7 payrolls
   7 panic
   7 pan
   7 palo
   7 package
   7 output
   7 outgoing
   7 oscars
   7 ordering
   7 onto
   7 oncology
   7 nyt
   7 november
   7 nov
   7 noto
   7 nicely
   7 nem
   7 mtch
   7 mt
   7 mrvl
   7 mps
   7 mouth
   7 mos
   7 monetization
   7 mo
   7 misunderstood
   7 mine
   7 mindful
   7 mill
   7 milk
   7 mike
   7 midas
   7 mid-roll
   7 mid-<num>
   7 metal
   7 measures
   7 mck
   7 mchp
   7 matt
   7 matches
   7 marissa
   7 malls
   7 loan
   7 letting
   7 letter
   7 legacy
   7 largely
   7 large-cap
   7 laptops
   7 la
   7 knowledge
   7 kicked
   7 kbe
   7 k
   7 jwn
   7 jones
   7 iyt
   7 ip
   7 introduces
   7 inspiration
   7 insane
   7 innovative
   7 include
   7 incl
   7 inaugurationday
   7 implied
   7 imminent
   7 image
   7 ig
   7 icpt
   7 iau
   7 hyg
   7 howard
   7 housing
   7 hiv
   7 hedging
   7 headphone
   7 hbi
   7 harder
   7 harassment
   7 handed
   7 hairline
   7 hacks
   7 ground
   7 grmn
   7 grilling
   7 greatest
   7 gps
   7 gov't
   7 goodbye
   7 gmail
   7 georgiadis
   7 gems
   7 games
   7 gaap
   7 futs+<num>
   7 ftnt
   7 fri.
   7 fri
   7 fracture
   7 focused
   7 florida
   7 first-quarter
   7 film
   7 files
   7 fdml
   7 fat
   7 fas
   7 faraday
   7 fab
   7 explained
   7 executives
   7 everybody
   7 eventually
   7 estate
   7 enormous
   7 engaged
   7 effects
   7 effective
   7 earning
   7 dynamic
   7 dry
   7 driven
   7 dltr
   7 dishwasher
   7 discussing
   7 detected
   7 depending
   7 deeper
   7 deep
   7 db
   7 darren
   7 currency
   7 ctsh
   7 crushing
   7 crush
   7 covering
   7 corp
   7 conducting
   7 concerning
   7 computer
   7 complicated
   7 column
   7 collect
   7 clvs
   7 clues
   7 climbed
   7 clever
   7 chuck
   7 choose
   7 chipmaker
   7 charles
   7 charges
   7 certain
   7 ceraweek
   7 cases
   7 capex
   7 cancelled
   7 campbell
   7 cac+.<num>
   7 button
   7 burger
   7 btwn
   7 broadcast
   7 brick
   7 brazil
   7 blown
   7 bitter
   7 became
   7 basic
   7 band
   7 back-tester
   7 azn
   7 asp
   7 aside
   7 arry
   7 arkansas
   7 apparently
   7 amidst
   7 alto
   7 alliance
   7 aid
   7 advertisers
   7 adversely
   7 advance
   7 adjustment
   7 addressed
   7 additions
   7 adapt
   7 actions
   7 a/h
   7 @yahoo
   7 @wilfredfrost
   7 @uaw
   7 @tischendorf
   7 @timseymour
   7 @reddogt<num>
   7 @peterfrost
   7 @pateltexas
   7 @nasdaq
   7 @nanexllc
   7 @miriamgottfried
   7 @mikhail<num>
   7 @mikeisaac
   7 @melissaleecnbc
   7 @lisahopeking
   7 @kimblecharting
   7 @keithmccullough
   7 @jackycwong
   7 @ibm
   7 @humonthemarkets
   7 @foxbusinessam
   7 @edvanderwalt
   7 @crystalkimmm
   7 @chevron
   7 @cgrantwsj
   7 @callieabost
   7 @bysamro
   7 @ben_levisohn
   7 @beckyquick
   7 @barclays
   7 <num>t
   7 <num>mm
   7 <num>..
   7 <num>-years
   7 <num>-k
   7 'tesla
   7 'good
   6 znga
   6 yourmoney
   6 xlu
   6 xiv
   6 wrap
   6 wou
   6 worker
   6 west
   6 weibo
   6 wed.
   6 websites
   6 webb
   6 wearables
   6 wday
   6 watches
   6 wasn
   6 walkie
   6 wagner
   6 vod
   6 vixy
   6 violations
   6 viewers
   6 viewed
   6 valued
   6 usb
   6 upswing
   6 upholds
   6 unwanted
   6 unsustainable
   6 unstoppable
   6 unfortunate
   6 ul
   6 u.s
   6 u-s
   6 tweeting
   6 tw
   6 tsm
   6 trumps-
   6 triple
   6 treats
   6 treatments
   6 travelers
   6 transactions
   6 tra
   6 toxic
   6 touched
   6 topic
   6 tomb
   6 titanfall
   6 tif
   6 tier
   6 tidal
   6 thoughtful
   6 thats
   6 tens
   6 tend
   6 techs
   6 technologies
   6 tcehy
   6 tar-jay
   6 talkies
   6 tale
   6 symptoms
   6 sweat
   6 sv
   6 sustained
   6 suspend
   6 surveillance
   6 supporter
   6 suggesting
   6 suffering
   6 subsidies
   6 subscription
   6 stubhub
   6 struck
   6 strikes
   6 strange
   6 stoc
   6 stealing
   6 stats
   6 states
   6 stance
   6 stakes
   6 spun
   6 spring
   6 spotify
   6 spinning
   6 spikes
   6 spiked
   6 speakers
   6 sparks
   6 south
   6 sources
   6 sour
   6 somewhere
   6 snb
   6 smh
   6 smartwatch
   6 smallest
   6 slumping
   6 slips
   6 slip
   6 slight
   6 slew
   6 slb
   6 sky
   6 sjm
   6 situation
   6 sits
   6 shw
   6 shopify
   6 shockingly
   6 shocker
   6 shifting
   6 sherling
   6 sharp
   6 shame
   6 settle
   6 senior
   6 sending
   6 segment
   6 seesaws
   6 seat
   6 screamed
   6 scorched
   6 scooping
   6 schwartz
   6 schleifer
   6 saved
   6 sarepta
   6 safmf
   6 sabotaged
   6 rotating
   6 rollover
   6 rocket
   6 robbins
   6 risk/reward
   6 rio
   6 rhhby
   6 revisit
   6 revelations
   6 revealed
   6 retain
   6 respect
   6 reserves
   6 request
   6 reputational
   6 represent
   6 replace
   6 rep
   6 remove
   6 related
   6 refugee
   6 recover
   6 recording
   6 recommends
   6 realities
   6 ramp
   6 punishes
   6 pumped
   6 protests
   6 promise
   6 projections
   6 producing
   6 processor
   6 processing
   6 printing
   6 priceless
   6 prep
   6 premises
   6 porat
   6 popularity
   6 pointless
   6 pleased
   6 pit
   6 pissed
   6 photos
   6 phones
   6 phenomenal
   6 peter
   6 persists
   6 performances
   6 perfect
   6 passes
   6 particularly
   6 participated
   6 parkour
   6 panel
   6 pact
   6 oy
   6 oversold
   6 overlook
   6 outweigh
   6 outrage
   6 outlets
   6 outcome
   6 ot
   6 orgs
   6 optimistic
   6 opportunities
   6 oppo
   6 oof
   6 oi
   6 odds
   6 odd
   6 obsessed
   6 o
   6 nya
   6 numerous
   6 ntap
   6 noted
   6 notch
   6 notablecalls
   6 non
   6 nobody
   6 nmbl
   6 nfl
   6 newer
   6 nets
   6 nav
   6 nap
   6 naaim
   6 muscular
   6 movie
   6 mortar
   6 moonshots
   6 mon/tue
   6 moments
   6 mnuchin
   6 mins
   6 millennial
   6 mid-february
   6 metals
   6 mcpick
   6 mcdlt
   6 matching
   6 marvelous
   6 magnificent
   6 macs
   6 luck
   6 lpl
   6 loyalty
   6 low-volume
   6 loser
   6 loop
   6 lods
   6 lobbying
   6 ll
   6 live-streaming
   6 lining
   6 lift
   6 liek
   6 leverage
   6 learned
   6 law-enforcement
   6 lag
   6 lacking
   6 kre
   6 kong
   6 kick
   6 kevin
   6 juicy
   6 joy
   6 joseph
   6 jonas
   6 jerry
   6 iv
   6 itunes
   6 issuing
   6 irs
   6 iron
   6 iran
   6 ioc
   6 involving
   6 involves
   6 invited
   6 introduced
   6 intra-day
   6 intime
   6 institution
   6 inov
   6 initiated
   6 indication
   6 incorrect
   6 in-seat
   6 imo
   6 ill
   6 ibkr
   6 hype
   6 hugin
   6 hong
   6 honestly
   6 holdings
   6 hinders
   6 highlighting
   6 high-profile
   6 hero
   6 hepatitis
   6 hep
   6 helicopter
   6 heating
   6 heart
   6 hawks
   6 hates
   6 hanging
   6 haha
   6 guides
   6 guardian
   6 grows
   6 grown
   6 graph
   6 gracias
   6 gov
   6 generation
   6 galaxy
   6 gaining
   6 gainers
   6 gadfly
   6 g/a
   6 fumble
   6 frustration
   6 frozen
   6 freedom
   6 fr
   6 founder
   6 ford
   6 forces
   6 forbes
   6 foray
   6 fodder
   6 fly
   6 flows
   6 fl
   6 finalists
   6 figured
   6 fighting
   6 field
   6 fentanyl
   6 feb.
   6 fcasts
   6 fbi
   6 fassler
   6 fared
   6 familiar
   6 fallout
   6 failure
   6 extra
   6 extending
   6 extend
   6 exposed
   6 explain
   6 experiencing
   6 experienced
   6 expenses
   6 exist
   6 excite
   6 exception
   6 ex
   6 evil
   6 estimated
   6 espn
   6 escapes
   6 eo
   6 encouraged
   6 emphasizing
   6 eliminating
   6 elf
   6 elect
   6 einhorn
   6 eight
   6 e
   6 dystrophy
   6 dying
   6 dumps
   6 dumping
   6 duchenne
   6 drowning
   6 drink
   6 dominance
   6 documents
   6 divergences
   6 dissuader
   6 disappoints
   6 disappear
   6 difference
   6 developing
   6 design
   6 depot
   6 depends
   6 democrat
   6 deficit
   6 decent
   6 dec.
   6 daughter
   6 dapl
   6 daniel
   6 dan
   6 damn
   6 dammit
   6 csarl
   6 crossing
   6 critics
   6 criticism
   6 critical
   6 cracking
   6 cpb
   6 cosmetics
   6 correcting
   6 corner
   6 corey
   6 cooperation
