 702 !
2026 %
1209 &
 554 '
 900 ''
  21 '<num>
   3 'a
   2 'ad
   1 'almost
   1 'america
   5 'an
   1 'and
   2 'any
   1 'appetizer
   1 'are
   1 'as
   1 'attention
   5 'be
   5 'beacon
   1 'bearish
   5 'being
   1 'best
   3 'big
   1 'blowout
   4 'boring
   1 'breaking
   4 'buy
   1 'carpool
   1 'certainty
   1 'cisco
   5 'clearly
   1 'close
   1 'cloud
   1 'confirmed
   4 'congestion
   5 'constitutional
   3 'could
   1 'customers
   1 'cycles
  37 'd
   5 'dewie
   6 'disgusting
   4 'disruption
   1 'drugs
   1 'earbuds
   5 'easy
   1 'edge
   1 'einstein
  10 'em
   1 'encouraging
   1 'enterprise
   2 'everybody
   1 'exciting
   1 'expect
   5 'explosive
   5 'facebook
   6 'fake
   5 'fatigued
   1 'fees
   1 'few
   5 'fire
   1 'flesh
   1 'frighteningly
   4 'fuck
   3 'future
   2 'gets
   1 'giant
   1 'gigafactories
   7 'good
   1 'great
   1 'green
   1 'group
   1 'had
   5 'hard
   1 'hearable
   1 'high-tech
   5 'highly
   1 'his
   1 'how
   1 'i
   5 'if
   1 'in
   1 'investment
   1 'iphone
   4 'is
   1 'jointly
   1 'leave
   5 'less-bad
   1 'likes
 113 'll
   4 'look
 111 'm
   1 'manchester
   6 'messy
   1 'moderate
   1 'modest
   1 'morning
   1 'multiple
   4 'news
   1 'nitpicking
   2 'no
   2 'not
   1 'o
   1 'ol
   2 'old
   1 'open
   3 'other
   1 'our
   5 'overvalued
   1 'planet
   1 'potential
   1 'powder
   3 'quiet
   1 'rail
 173 're
   1 'reactions
   2 'really
   2 'record-laden
   2 'retail
   5 'rule
   3 'runaround
3236 's
   5 'safe
   2 'safety
   1 'salesforce
  22 'sell
   2 'services
   3 'significant
   4 'smart
   1 'software-enabled
   2 'solid
   5 'some
   4 'spoofing
   5 'star
   1 'status
   1 'stay
   1 'stepping
   1 'steve
   4 'strangely
   1 'stranger
   2 'strong
  15 'super
   1 'superlong
   1 'sweet
   7 'tesla
   9 'the
   1 'these
   9 'this
   5 'threat
   4 'toast
   2 'too
   4 'trash
   5 'trashes
   4 'trump
   4 'unlikely
   1 'us
   1 'users
 114 've
   2 'very
   5 'weak
   1 'weekly
   1 'what
   3 'whole
   1 'win
   1 'would
   5 'you
   1 'youtube
   1 'zero
 824 (
 812 )
  23 *
   1 ***
   1 **live
   1 *amazing*
   1 *at
   1 *attempt
   4 *but*
   1 *cogent*
   1 *constant*
   1 *double*
   1 *early*
   1 *exclude
   1 *five*
   1 *is*
   1 *live
   1 *loud/slow
   1 *meaningful*
   1 *preceding*
   4 *quietly*
   4 *reaction*
   1 *rep.
   1 *right
   1 *should*
   1 *shrug*
   1 *this*
   1 *will*
  80 +
   2 ++action
   2 +.<num>
   3 +/-
 210 +<num>
  11 +<num>,<num>
  92 +<num>.<num>
  31 +<num>.<num>m
   2 +<num>bps
   2 +<num>m
   1 +<num>pt
   1 +<num>x
   1 +double
   1 +eps
   1 +ve
6378 ,
1355 -
 405 --
   1 -.<num>
 132 -<num>
   5 -<num>.
  71 -<num>.<num>
   6 -<num>.<num>m
  13 -<num>c
   1 -adj
   2 -another
   2 -bank
   1 -buffett
   1 -cash
   1 -could
   3 -dragonfly
   1 -financials
   1 -friday
   2 -i
   5 -look
   1 -nice
   1 -or
   5 -time
   1 -utilities
   5 -we
   1 -wsj
8997 .
  50 ..
 636 ...
   1 ..fill
   8 .<num>
   1 .<num>-.<num>
   1 .<num>s
   1 .aws
   1 .go
   1 .jus
   1 .right
   5 .run
   2 .russell
   1 .still
   2 .upper
   1 .yawn
  18 /
   9 //
   1 //webvideoio/output/social_video/sot<num>-sotmmmarketsread-<num>zyfs<num>ua_fbn_<num>_<num>-<num>_wmpg<num>.mp<num>
   1 /newnormal
   3 /share
   4 /via
   1 /vx
6348 :
1650 ;
6277 <num>
  20 <num>+
   2 <num>++
 235 <num>,<num>
   5 <num>,<num>+
   2 <num>,<num>,<num>,<num>
   1 <num>,<num>,<num>.
   3 <num>,<num>-<num>,<num>
   1 <num>,<num>-a-share
   1 <num>,<num>-horsepower
   1 <num>,<num>-point
   4 <num>,<num>-vehicle
   5 <num>,<num>.
  14 <num>,<num>.<num>
   1 <num>,<num>mi
  27 <num>-
  83 <num>-<num>
   2 <num>-<num>-<num>
   8 <num>-<num>.
   3 <num>-<num>.<num>
   1 <num>-<num>.<num>bn
   1 <num>-<num>b
   1 <num>-<num>p
   1 <num>-<num>x
   3 <num>-billion
   1 <num>-box
   1 <num>-cents
   5 <num>-d
  39 <num>-day
   5 <num>-days
   1 <num>-feb
   2 <num>-fold
   3 <num>-for-<num>
   3 <num>-hour
   1 <num>-inch
   7 <num>-k
   5 <num>-letter
   1 <num>-m
   1 <num>-minute
  23 <num>-month
   3 <num>-months
   4 <num>-mos
   1 <num>-ounce
   1 <num>-page
   1 <num>-point
   1 <num>-session
   3 <num>-straight
   3 <num>-style
   1 <num>-tranche
   3 <num>-w
  24 <num>-week
   3 <num>-wk
   5 <num>-y
  63 <num>-year
   5 <num>-year-old
   7 <num>-years
  10 <num>-yr
   1 <num>-yrs
 133 <num>.
   7 <num>..
1427 <num>.<num>
   4 <num>.<num>-
   3 <num>.<num>-<num>.<num>
   1 <num>.<num>-pts
   4 <num>.<num>.
   1 <num>.<num>.<num>
   1 <num>.<num>/.<num>
   2 <num>.<num>/<num>
   1 <num>.<num>/<num>.<num>
   1 <num>.<num>/<num>.<num>/<num>
   1 <num>.<num>/<num>.<num>/<num>.<num>/<num>
   5 <num>.<num>/<num>.<num>/<num>.<num>/<num>.<num>
   1 <num>.<num>/<num>/<num>/<num>.<num>
   1 <num>.<num>/jan
   6 <num>.<num>/share
 385 <num>.<num>b
   1 <num>.<num>b+
   1 <num>.<num>bln
  21 <num>.<num>bn
   3 <num>.<num>eps
  24 <num>.<num>ish
 151 <num>.<num>m
   1 <num>.<num>million
   1 <num>.<num>pm
   2 <num>.<num>t
   2 <num>.<num>x
   1 <num>.<num>~<num>b
   2 <num>.hk
   9 <num>/
   1 <num>/'<num>
  79 <num>/<num>
   2 <num>/<num>-<num>
   1 <num>/<num>.<num>
   1 <num>/<num>.<num>/<num>.<num>/<num>
   3 <num>/<num>.<num>/<num>/<num>
  43 <num>/<num>/<num>
   1 <num>/<num>/<num>-
   1 <num>/<num>/<num>.<num>
   2 <num>/<num>/<num>.<num>/<num>.<num>
   4 <num>/<num>day
   1 <num>/<num>rd
   1 <num>/<num>th
   1 <num>/<num>ths
   1 <num>/apr
   2 <num>/jan
   1 <num>/jun
   1 <num>/kwh
   1 <num>/last
   1 <num>/mar
   1 <num>/month
  12 <num>/n
   1 <num>/rev/year
   2 <num>/sh
  12 <num>/share
   1 <num>/shr
   1 <num>/us
   1 <num>/year
  40 <num>:<num>
   1 <num>:<num>-<num>:<num>
   1 <num>:<num>:<num>
   1 <num>:<num>a
   1 <num>:<num>a.m
   3 <num>:<num>am
   2 <num>:<num>ish
   1 <num>:<num>p
   1 <num>:<num>pm
   2 <num>a
   1 <num>a-<num>p
   2 <num>am
 109 <num>b
   1 <num>b+
   1 <num>b-
   1 <num>bestcos
   1 <num>bln
  18 <num>bn
   3 <num>bn+
   1 <num>bn/qtr
   5 <num>bps
 112 <num>c
   5 <num>call
  11 <num>d
   1 <num>daa
  64 <num>day
   1 <num>day-
   5 <num>ema
   6 <num>f
   4 <num>g
   3 <num>h
   2 <num>hrs
  31 <num>ish
   5 <num>ish-
 131 <num>k
   1 <num>k+
 137 <num>m
   6 <num>m+
   4 <num>m/gmv/month
   1 <num>m/year
   5 <num>market
   1 <num>microsoft
   7 <num>mm
   1 <num>mo
  16 <num>nd
   3 <num>p
   1 <num>p/share
  13 <num>pm
   1 <num>pt
   5 <num>put/<num>call
  60 <num>q
   9 <num>rd
  16 <num>s
   1 <num>sma
  46 <num>st
   7 <num>t
 107 <num>th
   2 <num>th-anniversary
   1 <num>th-straight
   1 <num>tr
   1 <num>trillion
   2 <num>weekhigh
  35 <num>x
   1 <num>x'ing
   6 <num>y
   8 <num>yr
   5 <num>yrs
  75 =
   1 ==
1489 ?
   6 @
   2 @.
  17 @<num>
   2 @<num>.<num>
   1 @<num>:<num>
   4 @<num>:<num>pm
   1 @<num>:<num>pm*
  24 @<num>capital
   2 @<num>ft<num>breadwinner
   1 @<num>hhsc
   4 @<num>morrowknight
  10 @<num>mstockgame
   1 @<num>to<num>mac
   4 @<num>wtc
   3 @<num>x
   3 @_davidelman
   2 @_seandavid
   2 @a<num>z
   2 @aapltree
   5 @aaronback
   3 @aaronlucchetti
   1 @aaronmederosch
   6 @abiolahp
   2 @abjtech
   1 @abnormalreturns
   1 @abramona
   1 @acesrose
   9 @adambain
  22 @adamfeuerstein
   2 @adamhgrimes
  10 @adamlashinsky
   2 @adammarx<num>
   1 @adamnash
  12 @adamsinger
   1 @addthis
   1 @adenaaneesaali
   1 @aditiroycnbc
   1 @adsteel
   6 @adweek
   1 @afterthebell
   1 @agterzis
   1 @agwarner
   1 @ailworth
   1 @airlinewriter
   2 @airxpander
   5 @ajinsight
   1 @akaarsalan
   1 @akaneotani
   3 @akeneotani
   2 @akikofujita
   1 @alannapetroff
   1 @alanweedspan
  16 @alex
   4 @alexeheath
   1 @alexfrangos
   1 @alexia
  12 @alexistvnews
   1 @alfredspellman
   1 @algore
   4 @ali
   5 @alibabagroup
   1 @alibabaprguy
   1 @aliciamcelhaney
   1 @alifarhat<num>
   1 @all
   3 @allergan
   1 @alliedprogress
   5 @allisonmcneely
   1 @allstarcharts
   1 @alphatrends
   1 @amacker
  39 @amazon
   2 @amberkanwar
   2 @amd
   9 @americanair
   1 @amjadjamous
   2 @ampressman
   2 @anderskeitz
   5 @andreascseh
   1 @andreicherny
   5 @andrewbarranca<num>
   1 @andrewhorowitz
   1 @andrewnyquist
   4 @andrewrsorkin
   1 @andrewtghill
  11 @andybiotech
  21 @angiemiles
   1 @anildash
   1 @anindakumars
   3 @annemarietrades
   1 @annierpalmer
   6 @anorajourno
  10 @anshelsag
   9 @anthonynoto
   1 @antoniobrown
   2 @antonjgunn
   1 @ap
   2 @appdynamics
 118 @apple
   3 @appleinsider
   2 @applemusic
   1 @appstore
   2 @arampell
   1 @arickrussell<num>
   5 @arjunkharpal
   1 @arjunsethi
   1 @arkindu
   3 @arkinvest
   2 @arkwebx<num>
   6 @armstrongcbc
   2 @askbbt
   1 @assettvus
   5 @assumeacanopenr
   1 @asymco
   2 @atbwebb
   4 @atmcharts
   4 @atticusliu
   1 @atticusmb
   5 @aussieflya
   1 @austenallred
   1 @automotive_news
   1 @aztecs<num>
   4 @bamabroker
   1 @bankinnovation
  23 @bankofamerica
   5 @barchart
   7 @barclays
   1 @barron
  12 @barrons
  47 @barronsasia
   2 @barronsisabella
  30 @barronsnext
   1 @barronsonlin
  59 @barronsonline
  27 @barronstechblog
   1 @bartosiastics
   1 @basche<num>
   1 @batsgl
   1 @batsglobal
   3 @beauwillimon
   7 @beckyquick
   1 @bedbathbeyond
   1 @behindthadeuce
   2 @belril
   6 @ben_dunbargk
   7 @ben_levisohn
   1 @beneisen
   5 @benfoxrubin
   2 @benioff
   1 @benlovejoy
   1 @benthefidler
  19 @benzinga
   5 @berkeleyjr
   1 @berkowitzbt
   1 @bertelschmitt
   1 @berthacoombs
  11 @bespokeinvest
   1 @betawork
   3 @bethjinks
   1 @beyonce
  53 @bfly
   1 @bi_retailnews
  37 @biintelligence
   1 @billda
   4 @bingdrinkkick
   1 @bio_clouseau
   1 @biohazard<num>
   1 @biorunup
   1 @biosimilarz
   1 @biotechfischer
   5 @biotechtoreador
   5 @birchfamilyserv
   1 @bitcoinpaul
   1 @biuk
  11 @biuk_tech
   1 @bivo
   1 @bjen<num>
   4 @bkbriankelly
   2 @bkollmeyer
   1 @blackrock
   1 @bleedsixcolors
  15 @bloomberg
   5 @bloombergbrief
   6 @bloombergradio
  14 @bloombergtv
   2 @blsuth
   3 @bluechoochoo
   1 @blueorigin
   1 @bmw
  11 @bnn
   3 @boardex
   2 @bobbyshea<num>
   1 @bobpisani
   1 @bobtannous
   3 @bondsfx
   1 @bosto
   1 @bradloncar
   2 @brady_fbn
   1 @bre_payton
   2 @breakingviews
   1 @brendanjcahill
  12 @brentlsaunders
   1 @brett_hershman
   1 @brettmolina<num>
   1 @brian_solomon
   1 @briancostawsj
   3 @briandcolwell
  28 @brianfires
   1 @brianprovost
   4 @briansozzi
   1 @brianwomack
   3 @bruce_croxon
   4 @bryantanders<num>
   3 @bthau
   1 @bubba_trading
   3 @bullfan<num>
  10 @business
  24 @businessinsider
   1 @buzzfeed
   1 @bv
   4 @bvz_investools
   2 @bw
   6 @bwilliliou
   1 @byheatherlong
   1 @bymadeleinea
   4 @byrnerws
   7 @bysamro
   2 @bytomlee
   1 @bzawards
   1 @cahillonbiz
   7 @callieabost
  13 @callum_thomas
   1 @camaldarelli
   1 @candicemcoy
  36 @canuck<num>usa
   1 @capcube
   4 @capitalobserver
   1 @carl_c_icahn
   1 @carletonenglish
   1 @carlosmoreirajr
   8 @carlquintanilla
   1 @carolinehydetv
   1 @carolineylchen
   2 @carollmatt
   4 @carolmassar
   5 @cartermansbach
   1 @caschaberg
  19 @caterpillarinc
   1 @cathiedwood
   1 @cathybessant
   1 @cato<num>lives
   1 @cats_and_code
   1 @catskillfishing
   1 @cbcnews
   1 @cbinsights
   5 @cboe
   6 @cbsla
   3 @cbsthismorning
   9 @cecileva
   1 @celgene
   8 @cerebrus<num>
   3 @ceverson
   1 @cezary
  12 @cfojournal
   3 @cfpb
   6 @cfraresearch
   3 @cgartenhaus
   6 @cgasparino
   7 @cgrantwsj
   8 @chamath
  29 @charliebilello
   1 @charlierose
   1 @chartiq
   1 @chartlabpro
   1 @chase
  31 @cheddar
   2 @cherylcasone
   7 @chevron
   1 @chicagobluesky
   5 @chicagosean
   1 @chicagostock
   5 @chipcorley
   1 @chistocks
   5 @chitribbiz
   1 @chowdachief
   1 @chris<num>reuters
   1 @chris_ciaccia
   1 @chrisb_ig
   4 @chrisdieterich
   2 @chrishayesg
   2 @chrishelman
   1 @christhesuit
   1 @christianfaes
   1 @christianhern
   1 @christianmagoon
   2 @christiiineeee
   1 @chuckgrassley
   2 @chuckrobbins
   1 @ciovaccocapital
   2 @circa
   6 @cisco
   4 @citi
   5 @claireatki
   1 @claudiassis<num>
   1 @clusterstock
  51 @cmlviz
   1 @cmroberson<num>
  60 @cnbc
  36 @cnbcclosingbell
   2 @cnbcdiaz
  41 @cnbcfastmoney
   2 @cnbci
   3 @cnbcjosh
  30 @cnbcnow
   2 @cnbcoriel
   1 @cnbcpro
   8 @cnet
   1 @cnni
  42 @cnnmoney
   3 @cnnmoneyinvest
  18 @cnntech
   1 @cntechinsights
   1 @colombia_bot
   1 @compoundcap
   3 @consumerreports
   5 @convertbond
   1 @coolhunting
   1 @cornel<num>m
   1 @corpgovnet
   8 @corytv
   2 @coryweinberg
   4 @costco
   2 @courtreagan
   1 @cowenandcompany
   1 @cowenresearch
   3 @crackedmarket
   1 @crainschicago
   1 @cramersshirt
   1 @crazyfasteddy
   2 @crestronhq
   1 @crn
   1 @crntestcenter
   1 @crosshairtrader
   1 @cryptoethan
   7 @crystalkimmm
   2 @crystalxlau
   3 @cswadley
   1 @ct<num>
   1 @cue
   1 @cumiastowski
   4 @cvpayne
   1 @cycleflyer
   3 @cynthialkoons
   4 @d<num>ytrad<num>
   2 @dagenmcdowell
   1 @dailymail
   6 @dakincampbell
   1 @danbudwick
   2 @danieleran
   1 @danielernsttmt
   1 @daniellebochove
   1 @danielsparks
   1 @danlipp<num>
   1 @danzanger
   1 @darrengratson
   3 @darrenheitner
   2 @dasan
   1 @dasarteyarnway
   1 @data
   1 @datasift
   4 @daveaurelio
   1 @davecbenoit
   1 @davecraige
   1 @david_darst
   5 @davidbrancaccio
   4 @davidfaber
   2 @davidgfool
   4 @davidgoldmancnn
   2 @davidgura
  15 @davidgzeiler
   1 @davidinglestv
   1 @davidjacobslive
   5 @davidmaris
   1 @davidmoble
   2 @davidschawel
   1 @davidseaburg
   1 @davidwestin
   1 @dawngiel
   1 @debbywuintaipei
   2 @dee_bosa
  21 @defotis
   1 @deliverydotcom
   1 @delrey
   8 @deoneroberts
   1 @derkomizar<num>
   4 @desantis
   6 @detroitnews
   4 @devinwenig
   3 @dewdiligence
   4 @dickc
   2 @digiday
   2 @digitalmusicnws
   2 @disruptorsbnn
   1 @dividendmaster
   1 @divinebizkid
   1 @djtgallagher
   1 @dlippman
   4 @dnanexus
   2 @domsplaying
   4 @donnayoungdc
   6 @donutshorts
   1 @dostisrobert
   3 @dougkass
   1 @dr<num>
   1 @dr_options
   1 @dressforsuccess
   1 @drose<num>
   1 @drpaulydesantis
   1 @drudge_report
   1 @drugchannels
   5 @ds_investools
   5 @dsarna
   4 @dseetharaman
   1 @dsobek
   1 @dtellom
   3 @dubois
   3 @duked<num>
   1 @dynamicvol
   2 @e_russell
   4 @earningsscout
   5 @echasan
   5 @econmatters
   1 @economichedge
   1 @econompic
   1 @ed
   1 @eddyelfenbein
   1 @edensclipps
   1 @editasmed
   7 @edvanderwalt
   1 @eeotob
   5 @elanazak
   1 @eldogeseeker
   5 @electrekco
   1 @elizabethgurdus
   4 @elkwood<num>
   1 @ellenychang
  41 @elonmusk
   1 @elwinslow
   1 @emilylongeretta
   5 @emilystewartm
   1 @emmarcourt
   3 @endpts
   3 @energzdeconomy
   1 @engelsangle
   1 @enigmaconf
   1 @epvantage
   1 @ericbalchunas
  14 @ericjhonsa
   1 @eriiiic
   5 @erikholmwsj
  11 @ernestscheyder
   1 @eschor
  19 @estimize
   1 @etf.com
   5 @evanmedeiros
   1 @evannex_com
   1 @evranic
   5 @ewolffmann
   4 @expedia
  15 @exxonmobil
   1 @eyepowerment
   5 @f
  34 @facebook
  15 @factset
   3 @fastcompany
   1 @faubel
   1 @fcc
   8 @fedex
   1 @feriainvestor
   1 @ferrotv
   3 @fhoro
   4 @fiercepharma
   6 @fijitime<num>
   8 @filmprofessor<num>
   1 @financialnews
   1 @financialpost
   2 @financialreview
   1 @finimize
   6 @firstadopter
   1 @firstadopter..
   2 @fitbit
   1 @flower_power_<num>
   4 @fmanjoo
  21 @forbes
   2 @ford
   1 @forensicinvstor
   6 @fortunemag
   6 @fortunemagazine
   1 @fortunempw
   1 @fosspatents
   1 @foxbusin
  23 @foxbusiness
   7 @foxbusinessam
   1 @foxjust
   1 @foxnewsresearch
   4 @fpinvesting
   2 @francesdonald
   5 @frankmazza<num>
   6 @frankmottek
   1 @freddiethekat
   2 @fredericlambert
   2 @fredwilson
   1 @freeboardcap
  16 @ft
   1 @fuckingtrader
   1 @fuergando
   1 @full_kit_yankee
   2 @fundstrat
   5 @fxshaw
   4 @fzucchi
   1 @gameofthrones
   2 @gartenberg
   1 @garybsmith
   2 @garyvee
   1 @gasbuddyguy
   4 @gdinges
   2 @geekwire
   2 @gerberkawasaki
   2 @ghawkinz
  11 @gigabarb
   3 @gileadsciences
  10 @gilliantan
   1 @gilliantett
   1 @gilluria
   1 @girlswhocode
   4 @globeandmail
   1 @globebized
   1 @gm
   3 @gmorgenson
   5 @gnarlydragoons
   1 @goldenzephyr
   1 @goldhat_lou
  33 @goldmansachs
   4 @gomoneybadger
  13 @google
   1 @googlecloud
   1 @googleplay
   1 @gopoversight
   1 @gportell
   1 @grantmbeasley
   1 @grantspub
   2 @grapeshotrtb
   2 @grassosteve
   2 @greenmonsterah
   1 @greglieber
   1 @gs<num>kwomen
   2 @gsbruno<num>
   5 @gscareers
   1 @guruleaks<num>
  10 @guyadami
   1 @gwydion_<num>
   1 @hagaton
   3 @hainsworthtv
  25 @halftimereport
   1 @hamiltonmusical
   1 @hamzahkingkhan
   1 @hannahkuchler
   1 @haodongvli
   3 @hap_sneddon
   1 @happeningnow
   1 @harmongreg
   1 @harri<num>t
   1 @heatherchilders
  17 @hedgeye
   3 @hedgeyefood
  13 @hedgeyehwp
  13 @hedgeyeindstrls
   6 @hedgeyeinternet
  10 @hedgeyeretail
   1 @hedgeyesnakeye
   5 @hedgiemark
   1 @heidstertrades
   1 @henrygambell
   4 @herbgreenberg
   2 @heyimsnuffles
   4 @hillaryclinton
   4 @holon
  17 @howardlindzon
   1 @howardu
   6 @hsilverb
   5 @hugh_son
   5 @humblestudent
   7 @humonthemarkets
   1 @huntandfishnyc
   2 @hussmanjp
   4 @hustonca
   1 @ianrosen
   3 @ibd_ecarson
   6 @ibd_elow
   3 @ibdinvestors
   7 @ibm
   2 @ibmnews
   3 @icsc
   2 @ifc_org
   1 @ifrtweets
   1 @igaus
   5 @igcom
   1 @igsquawk
   3 @igtv
   2 @imore
   1 @indianagraininc
   1 @indystar
   5 @instagram
   1 @integragoldcorp
   5 @intel
  37 @investopedia
   1 @investorslive
   5 @ivanhoff
   6 @ivanthek
   2 @iviewmarkets
   1 @iyengarish
   1 @j_holliman
  69 @jack
   1 @jack_analyst
   1 @jackbobeck
   2 @jackhough
   1 @jackmarshall
   7 @jackycwong
   1 @jacob_mintz
   5 @jacobawohl
   1 @jakemalewis
   2 @jaketapper
   1 @jakscholes
   1 @jam<num>maj
   1 @jamescov
   5 @jamescovert<num>
  12 @jamesliamcook
   1 @jamespasseri
   1 @jamieheller
   2 @jason
   5 @jason_kint
   5 @jasonmilano<num>
   1 @jasonraznick
   5 @jato_dynamics
   1 @javierblas<num>
   4 @jayelang
   1 @jbeyda
   1 @jboorman
   3 @jboorstin
  25 @jbooton
   1 @jclayfield
   6 @jcmccracken
   1 @jcp_org
   1 @jdawg<num>
   3 @jdblum<num>
   3 @jdmarkman
   1 @jdonaldson<num>
   1 @jedimarkus<num>
   1 @jeff_burke<num>
   1 @jeffbezos
   1 @jeffcooperlive
   1 @jefferiesevents
   1 @jeffinance
   1 @jeffkibuule
   1 @jeffkilburg
  18 @jeffmacke
   4 @jenishinbollywo
   1 @jennifersaba
   1 @jennyqta<num>
   5 @jennysurane
   1 @jensaidit
   1 @jenwieczner
   4 @jeremynaylor_ig
   1 @jerryseinfeld
   5 @jessedrucker
   2 @jessefelder
   1 @jesseproudman
   1 @jessielivermore
   6 @jethromullen
   1 @jetscott
   3 @jfahmy
   2 @jhamel
 113 @jimcramer
   1 @jimnivison
   2 @jimtilton<num>
   5 @jkempenergy
   4 @jkrinskymkm
   1 @jkrinskypga
   1 @jlebenthal
   1 @jmac_si
   1 @jmorrison<num>
   1 @jo
   2 @joannlublin
   1 @jodienarsh
   6 @jodigralnick
   2 @joeatiger
   5 @joedeaux
   4 @joesquawk
   3 @joewalkerwsj
   1 @johcmuk
   3 @john_council
   3 @johncendpts
   1 @johnkicklighter
   1 @johnkoetsier
   1 @johnlaprise
   5 @johnnerkell
   1 @johnnymartin
   1 @johnscharts
   1 @johnsculley
   2 @johnspall<num>
   5 @johnzechner
   2 @jolingkent
   1 @jonas_ogren
   2 @jonathanmaze
   2 @jonathanrockoff
   1 @jonchevreau
   3 @jonerlichman
   2 @jonfortt
  34 @jonnajarian
   1 @jonnyknews
   1 @jonsc
   2 @jonsteinberg
   1 @joshcrum
   1 @joshjame
  15 @jowens<num>
   5 @jpm<num>
   2 @jpmanga
   1 @jpmorgan
   1 @jq<num>t
   1 @jralexanderiii
   1 @jsherkow
   1 @jsnell
   1 @jstanleyfx
   1 @jstbiotech
   1 @jswartz
   1 @judsonalthoff
   3 @juleshyman
   1 @juliakhorowitz
   1 @juliebishopmp
   1 @junheng_li
   1 @justinbaer
   1 @justinpulitzer
   3 @jwan<num>
   4 @jyarow
   1 @jzabe
   2 @k_chiglinsky
  12 @kantar
   1 @kantarretail
   4 @kapelianis
   2 @karangoel
   1 @karaswisher
   1 @karenfinerman
   2 @karenhunter
  13 @katekelly
   1 @kateyrich
   5 @katiadmi
   1 @kayla
   3 @kaylatausche
  17 @kchaykowski
   1 @keegan_simzer
   7 @keithmccullough
   1 @kenbrown<num>
   5 @kennyfoley<num>
   5 @kerrymflynn
   3 @kesslercfra
   1 @kevin_scott
   3 @kevinkellyrecon
   2 @kevinkingsbury
   6 @kevinolearytv
   1 @kevinpalmer
   1 @keystonecfp
   2 @kidkapital
   1 @kifleswing
   7 @kimblecharting
   1 @kmccabe<num>
   1 @kn
   6 @knx<num>
   1 @knxfr
   2 @knxfrank
   2 @kopintan
   5 @korihale
   3 @kpdavitt<num>
   1 @kristenscholer
   1 @kristineowram
   3 @krshya
   1 @kruse
   6 @kurtwagner<num>
   2 @labboudles
   1 @laclippers
   6 @ladyfohf
  70 @lamonicabuzz
   1 @lanceippolito
  34 @lanceroberts
   1 @lanceulanoff
   1 @larry_kudlow
   1 @launchticker
   1 @laurajkeller
   1 @laurastevenswsj
   1 @lavery<num>
   8 @lawandloubs
   6 @ldelevingne
   1 @ldpinsd
   5 @ldrogen
   2 @leafoxnews
   9 @lebeaucarnews
   1 @lebron
   1 @leejay<num>s
   1 @leejhsmith
   1 @lendingtree
   1 @lendinvestjamie
   2 @leonlazaroff
   5 @leslieberland
   1 @leutholdgroup
   5 @levynews
   1 @lhhalstead
   8 @liamdenning
   1 @lightspeedvp
   5 @lilyjamali
   2 @linkedin
   8 @linnaneciara
   2 @lipper_alpha
   1 @liquidnet
   1 @lisabarrington
   1 @lisabrownstl
   7 @lisahopeking
   1 @liz_in_shanghai
   1 @lizaswagner
   2 @lizclaman
   5 @lizrhoffman
   1 @ljkawa
   2 @lkramer
   1 @llsethj
   1 @lmt<num>
   2 @loomdart
   1 @lostonwallst_
   2 @loubasenese
   2 @louiswinthrop
   3 @loupventures
   2 @louwhiteman
   1 @loveyourcrm
   1 @lsatpro<num>
   1 @luzi_ann
   1 @lydiaramsey<num>
   1 @macquarie
   1 @macroviewpoints
   6 @madmoneyoncnbc
   5 @maggielake
   2 @maggienyt
   3 @malibuinvest
   4 @mansfieldforpa
   5 @marathonwealth
   1 @marc_slans
   4 @marcmakingsense
   5 @marcomnyc
   1 @marcorubio
   9 @marcus
   3 @mariabartiromo
   1 @mariahalkias
   1 @marijuanastocks
   2 @mariojosepalma
   5 @marissamayer
   8 @markarbeter
   5 @markbspiegel
   1 @market
   6 @marketcurrents
   2 @marketfoolery
   9 @marketplace
  20 @markets
  15 @marketwatch
   1 @markflowchatter
   1 @markgurman
   1 @markleibman
   9 @marknewtoncmt
  13 @markyusko
   6 @marleykayden
   1 @marriott
   5 @martyswant
   1 @masterofcharts
   2 @mathewi
   4 @matt_levine
   3 @matt_townsend
   1 @matt_valdez
   2 @mattel
   5 @mattgoldstein<num>
  14 @matthewherper
   1 @matthewphillips
   3 @mattleising
   1 @mattmcfarland
   5 @mattmegan<num>
   1 @mattmhunter
   4 @mattmillercubed
   4 @mattrosoff
   4 @maxjacobsedison
  14 @maxnisen
   1 @maxpyziur
   3 @mayaichung
   5 @mbearresearch
   1 @mcdonald
  15 @mcdonalds
   3 @mcdonaldscorp
   1 @mclamagna
   1 @mcuban
  16 @mcwm
   1 @mdecambre
   1 @me
  38 @megtirrell
   2 @megynkelly
   4 @melinanders
   1 @melissahartwig_
   7 @melissaleecnbc
   2 @melodyhahm
   2 @merck
   3 @mevans<num>
   1 @mhbergen
  21 @michael_khouw
   1 @michaelbabad
   3 @michaelbatnick
   1 @michaeldendor
   2 @michaelglamothe
   2 @michaellebowitz
   3 @michaelpachter
   2 @michaelsantoli
   1 @michellef_davis
   1 @microcapcompany
   1 @microfundy
  11 @microsoft
   1 @mikedonof
   7 @mikeisaac
   3 @mikesnider
   7 @mikhail<num>
   3 @miningjunkie
   7 @miriamgottfried
   2 @mishcastillo
   5 @misleadme
   1 @misskennedys
   1 @mitchellkwarren
   1 @mjbologna
   5 @mjenkins
   1 @mjmegladon
   1 @mktinflections
  10 @mktsinsider
   3 @mktwhulbert
   1 @mliburdi
   4 @mnkahn
   3 @mobilenations
   3 @modcloth
   4 @modestmoney
   1 @moneymetalcakes
   2 @moonalice
   3 @morganlbrennan
  10 @morganstanley
   1 @morningmoneyben
   3 @morningsmaria
   3 @motifinvesting
   2 @motleyfoolmoney
   4 @motleyfooltech
   1 @motortrend
   4 @mparekh
   1 @mr_showkz<num>
   1 @mredwardyun
   9 @msabalakrishnan
   3 @mschmitt<num>
   1 @mspoonauer
   2 @muz<num>now
   2 @myabj
   8 @mylesudland
   3 @n<num>rbie
   1 @nachkari
   1 @namoapp
   7 @nanexllc
   1 @narottammedhora
   7 @nasdaq
   2 @nateog
   1 @nathanchubbard
   1 @natisangulorico
   5 @navelhunt
   1 @nbuhayar
   1 @nealcoolong
   3 @neilblalock
   2 @neilcybart
   1 @neiltwitz
  22 @netflix
   1 @newamericano
   8 @newsmax
   1 @newsmax_media
   6 @nichcarlson
   1 @nick<num>demus
  17 @nickbilton
   1 @nickmcquire
  10 @nike
   1 @nimeshg
   5 @nintendoamerica
   1 @niraj
   3 @nishagopalanhk
   1 @nivo<num>o<num>
   1 @noanettrader
   3 @nod<num>
   5 @nolter
   1 @nordstrom
   2 @northmantrader
   4 @notabubble
   1 @npdmattpowell
   1 @npetallides
   1 @nsbe
   1 @nuss_banger
   1 @nversel
   1 @nvidia
  12 @nypost
   1 @nypostbiz
  15 @nyse
   5 @nyt
  10 @nytimes
   1 @nyuniversity
   1 @nyustern
   6 @oculus
   1 @oddstocktrader
   1 @oitnb
   1 @onpointradio
  74 @ophirgottlieb
   1 @optionpit
   8 @options
  37 @optionsaction
   2 @optionshawk
   4 @optionsplay
   2 @optiontradiniq
   1 @optuma
   1 @osukeller
   4 @otis_reid
   1 @our
   3 @ow
   3 @palmermx
   1 @parachutehome
   7 @pateltexas
   1 @patrickercole
   1 @patrickmoorhead
   5 @pattonles
   1 @paulbagnellbnn
   1 @paulcarsten
   1 @paulgelb
   1 @pauljsingh
   6 @paulvigna
  13 @pavelsenor
   1 @paypal
   2 @pdacosta
   1 @peekslive
   1 @peerstreet
   1 @periscope
   1 @periscopeco
   4 @petenajarian
   1 @peterbach
   1 @peterbachmd
   7 @peterfrost
   1 @petergarnry
   1 @peterhimler
   3 @peterlusk
   4 @peterschack
   1 @pgatour
   1 @ph
   1 @pharmascrip
   1 @pharmdca
   1 @philipaegerter
  15 @philipvandoorn
   2 @philmasch
   1 @philstockworld
   2 @philwahba
   5 @pinerguard<num>
   1 @pipstodollars
   1 @pjgoodfellow
   3 @pogue
   3 @politicopro
   1 @politico|s
   1 @poppyharlowcnn
   1 @popsci
   1 @portiacrowe
   1 @portlandunited
   1 @potstocks<num>
  15 @potus
   3 @potus<num>
  10 @powerlunch
   2 @poynter
   5 @pr
   1 @predatordiaries
   6 @probesreporter
   3 @profgalloway
   6 @ptpetrides
   2 @ptuchmannyse
   1 @puma
   2 @purewow
   1 @puru__saxena
   1 @putinrf_eng
   1 @pziobro
   1 @qqq
   3 @qtrresearch
   6 @quagmires
  20 @qualcomm
   1 @quantedges
   1 @r
   1 @racernic
   1 @rachelkbeals
   1 @rachelswarns
   3 @rampcapitalllc
   3 @ranaforoohar
   5 @randyafrederick
   1 @randygarutti
   1 @rapoportwsj
   3 @rbc
   1 @rchenmit
   9 @readdanwrite
   1 @realdonaldtru
  82 @realdonaldtrump
   5 @realjacobbell
   1 @realleadelaria
   1 @realronaldc
   1 @rebeccajarvis
  10 @recode
   4 @redacre
   7 @reddogt<num>
   2 @reedhastings
  13 @reformedbroker
   5 @regeneron
   5 @reneritchie
   1 @renesgarcia
   1 @resachs
  15 @retheauditors
   5 @retmilldaily
  26 @reuters
   5 @reutersbiz
   1 @reutersindia
   2 @reuterstech
   5 @reuterstv
   1 @rexshares
   2 @rgstocktrader
   3 @richardbeales<num>
   2 @richartross
  16 @richbtig
   1 @rickcarew
   1 @rickhorrow
   9 @rickjnewman
   1 @rickrothacker
  42 @riskreversal
   2 @ritholtz
   1 @ritholtzwealth
   3 @rjcc
   1 @rjonesy
   4 @rklouie<num>
   2 @rmbrenna
   1 @rob<num>cox
   5 @rob_cyran
   1 @robcheney
   3 @robenfarzad
   1 @roberee
   1 @robertoferris
   1 @robpegoraro
   1 @robtfrank
   2 @robwilliamsny
   6 @rodboydilm
   1 @rongross<num>
   1 @roosbrews
  10 @rorol
   1 @rosstucker
   1 @rr<num>
   6 @rudyhavenstein
  14 @russellrhoads
   1 @russward_tokyo
   1 @rwehrspann
   1 @ryan_knutson
   2 @ryanharwood<num>
   1 @ryanjtracy
   1 @ryanlawler
   3 @ryanvlastelica
   1 @rycrist
   1 @s<num>partners
   1 @sacca
   1 @sageworks
   4 @sai
   2 @salesforce
   2 @salesforce_ir
   2 @sallypancakes
   1 @sallyshin
   1 @salvagno
   1 @salvatore_jonah
   6 @sam_l_shead
   2 @samanthaladuc
   1 @sammyrodz
   1 @samsungmobile
  10 @sanglucci
   2 @sanofi
   6 @saraeisen
   1 @sarah_tennyson
   5 @saraheneedleman
   5 @sarahfrier
   1 @sarahkarlin
   1 @sarawalker_ig
   1 @sarge<num>
   1 @sarpring
   1 @saschoenfeld
   4 @sassy_spy
   3 @satyanadella
   2 @sbanjo
   1 @sbp<num>
   6 @scaramucci
   1 @scarl
   1 @scarletfu
   1 @schristiansen<num>
   1 @scmp_news
  12 @scottbudman
   6 @scottgamm
   2 @scottkirsner
   8 @scottwapnercnbc
   3 @scrt<num>
   5 @sdut
   1 @sdxcentral
   1 @sealteamssix
   1 @seamless
  21 @seanansmith
  55 @seeitmarket
   2 @seekingalpha
   8 @selerity
   1 @semil
   1 @senschumer
   1 @senwarren
   1 @serenawilliams
   1 @serpentineuk
   5 @serwer
   1 @settern
   2 @sfiegerman
   2 @shakeshack
   1 @shalini
   2 @shaneblackmon
   1 @shannansiemens
  26 @sharatibken
   3 @sharkbiotech
   1 @shaun<num>k<num>
   1 @shawsstandard
   1 @sheffstation
   1 @sheltonwillia<num>
   3 @sherisse
   8 @shiraovide
   6 @shitmgmtsays
  10 @shonaghosh
   1 @shonkori
   2 @shortyawards
   9 @shuli_ren
   1 @siatechhq
   1 @siliconlabs
   3 @silviaascarelli
   8 @simonettilauren
   4 @simonkingfw
   3 @simonsage
   1 @simonsinek
   1 @simplerchartart
   2 @sindycindy
   1 @singlesize
   5 @sirf_report
   1 @sixcolorsevent
   1 @skinnerliz
   9 @slangwise
   4 @sliceintel
   1 @sm_sears
   1 @sm_stocks
   1 @smartstocktrend
   5 @smileyborg
   2 @snap
  10 @snapchat
   1 @snlkagan
   3 @snowden
   1 @snowflakedb
   4 @society<num>science
   1 @somanewark
   4 @sonalibasak
   1 @sonjatrauss
   2 @souq
   1 @southwestair
   1 @spampennypicks
   1 @spectacles
   1 @spencerjakab
   2 @spettypi
   2 @spgmarketintel
   5 @spyjared
  15 @squawkalley
   1 @squawkboxeurope
  13 @squawkcnbc
   8 @squawkstreet
   8 @srussolillo
   1 @standardnews
  42 @starbucks
   5 @starbucksnews
   1 @starwars
   1 @statedept
   3 @statistacharts
   1 @statnews
   1 @stefan_wieler
   2 @stephanie_link
   1 @stephenlweiss
   1 @stephennellis
   1 @stephlandsman
   1 @steve_desaul
   1 @steveeasterbrk
   1 @stevekasko
   1 @stevekopack
   1 @steven_ballmer
   1 @stock
   3 @stockcats
   1 @stockstot
  21 @stockstotrade
  40 @stocktwits
   1 @stormwolf<num>
   5 @storyful
   1 @stovall
   6 @street_insider
   1 @stt<num>
   2 @stumcmullin
   1 @subrat_patnaik
   1 @sullycnbc
   3 @sundarpichai
   1 @swheelscpa
   5 @syncubate
   2 @t<num>live
   1 @t_muckerman
   1 @tandreacci
   1 @taralach
   1 @taralch
   1 @target
   1 @taskrabbit
   1 @tbohen
   1 @tcharnota
   3 @tculpan
   1 @td
   1 @tdajjkinahan
   3 @tdansherrod
   1 @teamcoworker
   1 @techcrunch
   2 @techguard<num>
   2 @techmeme
   1 @technical<num>
  14 @technology
   2 @techreview
   1 @telecommw
   1 @terra
   3 @terranovajoe
   1 @terrellowens
   3 @tesla
  14 @teslamotors
   5 @tfeshow
   1 @tgarcianyc
   1 @tgod.ca
   1 @thakursush
   1 @the
   2 @the_real_fly
   3 @thealexbente
   1 @thealtheachang
   2 @thebrandindex
   1 @thebubblebubb
   8 @thebubblebubble
   1 @thechallenge_uk
   3 @thechartress
   2 @thedaytradr
   1 @thedealnewsroom
   4 @thedomino
   1 @theeuchre
   1 @theflynews
   1 @theglasshammer
   1 @thegreggamba
   2 @theinformation
  13 @theiphawk
   1 @themoneygame
   8 @themotleyfool
   3 @thenotablecalls
   1 @theofrancis
   1 @there<num>
   2 @therealbethann
   1 @therealjethro
   1 @thestalwart
  94 @thestreet
   1 @thestreettech
   3 @theterminal
   1 @thevrfund
   1 @thirdgenwidget
   1 @thomasbcn
   1 @thomasrice<num>
   1 @thomsonreuters
   1 @thr
   3 @threepirates
   1 @tickerville
   1 @tiernanray
   2 @tierrapartners
  31 @tim_cook
   1 @timarmstrongaol
   1 @time
   2 @timkaine
 127 @timothysykes
   7 @timseymour
   1 @tipatat
   7 @tischendorf
   1 @titleconnector
   2 @tjkyner
   1 @tmacheel
   2 @tmfjmo
   1 @tmfknightly
   1 @tmfnewcow
   3 @tmfstockadvisor
   2 @toddhagopian
   1 @toddo<num>
   2 @toddsalamone
   1 @tomashbrooknpr
   1 @tombrammar
  11 @tomikilgore
   2 @tomkeene
   1 @tomsguide
   1 @tomterrarosa
   1 @tonyrobins
   3 @tonyromm
   2 @tonythestreet
   5 @topsteptrader
   5 @toyotamotorcorp
   3 @tpoletti
   1 @tradek
   1 @trader_<num>
   1 @traderscom
   1 @tradewise
   1 @trading_<num>_fun
   4 @tradingnation
   1 @travisk
   2 @trfinservices
   1 @trivestwealth
   1 @tsla
   1 @tsrandall
   2 @tuskmediallc
   1 @tuurdemeester
   1 @twillo<num>
  25 @twitter
   1 @twitterir
   5 @twtr
   1 @tyrangiel
   7 @uaw
   1 @uber
   1 @uclatheden
   2 @udalltechstrat
  12 @ukarlewitz
   5 @ulmanfinancial
   2 @unhedgedchatter
  10 @usatoday
   6 @usatodaytech
   1 @usnews
   8 @valaafshar
   2 @valeant
   1 @valeanttruth
   2 @valerieayoung
   4 @valuewalk
   3 @vanessablum
   1 @vanityfair
   1 @veedub<num>
   3 @venturebeat
   5 @verge
   1 @verizon
   1 @vetrratings
   1 @vettechtrader
  10 @vfhive
   5 @vicrek
   1 @vigneshnathanl
   6 @vipalmonga
   1 @virtus
   2 @vixandmore
   1 @vluck
   2 @voanews
   1 @vrscout
   3 @vsankholkar<num>
   3 @vz
   1 @wakko_tm
   2 @waldensiew
   6 @wallstcynic
  57 @wallstjesus
   1 @wallytee
   1 @walmart
   2 @waltbtig
   1 @waltergmurphy
   1 @walterralegh
   8 @warrenbuffett
   1 @washingtonpost
   5 @weaverwealthnc
   3 @web
   5 @weeklystockchar
   6 @wellsfargo
   1 @wharton
   1 @whatsreal<num>
   1 @whole<num>
  21 @wholefoods
   3 @wholefoodsdc
   7 @wilfredfrost
   1 @williampesek
   4 @williedelwiche
   1 @willypx<num>
   1 @wisemanj<num>
   1 @wlstcom
   1 @wmwitkowski
   1 @wokvnews
   2 @wolfofweedst
   1 @wolfy_<num>
   2 @womeninbio
   4 @wrigleytom
   1 @wrko
   4 @wrko<num>
  59 @wsj
   1 @wsjbusiness
   1 @wsjd
   5 @wsjheard
   2 @wsjmarkets
  11 @wsjmoneybeat
   2 @wsjpodcasts
   2 @wsjtanya
   2 @wsjtech
   1 @xbox
   1 @xerox
   1 @xgemtrader
   3 @xiongtx
   1 @xmcapitalgroup
   3 @xvlucky<num>
   7 @yahoo
 102 @yahoofinance
   1 @yalman_onaran
  14 @youtube
   1 @ytjohnson
   5 @yusifsdk
   4 @yusschr
   6 @zacangeline<num>
   2 @zacharybrennan
   1 @zbiotech
   8 @zerofiltertruth
   1 @zlatimeyer
   3 @zortrades
   3 @zozotrader
   2 @~
  26 [
  26 ]
   1 ^jc
   1 ^ko
   3 _
   6 _aggressively_
   1 _all_
   5 _avoiding_
   1 _call_
   1 _earnings_
   1 _exactly_
   1 _google
   1 _if_
   5 _really_
   5 _rip_
   1 _termann
   1 _with_
 897 ``
3550 a
   1 a-game
   1 a-shares
   1 a.<num>
   6 a.m.
   7 a/h
   5 a=c
  53 aa
   3 aa+
   1 aa-qf
   1 aaaaaaaaand
 110 aal
   2 aan
   2 aaoi
  11 aap
2083 aapl
   1 aaple
   1 aaww
   1 ab
   4 abandoning
  13 abbv
  22 abc
   1 abe
   1 abeo
   2 abf
   1 abhey
   4 ability
  13 able
   1 abmd
   2 abou
   6 abound
 520 about
 187 above
   1 above-
   6 abroad
   5 abroad+it
   1 abs
   4 absolute
  16 absolutely
   1 absorbing
   3 absurd
   4 absurdly
   9 abt
   4 abundance
   8 abuse
   5 abusive
   1 abut
  12 abx
   1 aca
   3 acacia
   2 acat
   2 acbff
   8 accelerate
  11 accelerated
   3 accelerates
   9 accelerating
   9 acceleration
   1 accept
   1 acceptable
   2 accepted
   8 access
   1 accessories
   4 accidents
   1 accomplishment
   1 accor
   1 accord
  26 according
  56 account
   2 accountants
   6 accounted
   9 accounting
  18 accounts
   2 accretive
   1 accumulate
   1 accumulating
   1 accuracy
  10 accurate
   3 accused
   1 ace
   1 aces
   1 acetate
   1 ach
   3 acha
   4 achc
   1 achievable
   5 achieve
   1 achieved
   1 achievement
   1 aci
   4 acia
  56 ackman
   3 acknowledges
   1 aclidinium
   2 aclu
   2 acm
   2 acne
   1 acor
  10 acquire
  11 acquired
   4 acquires
  25 acquisition
  14 acquisitions
   1 acre
   5 acronyms
  48 across
   1 across-the-board
   2 acrx
   1 acsi
  11 act
   3 acted
   1 acti
   6 acting
   1 actio
  67 action
   1 actionable
   7 actions
  68 active
   3 actively
   1 actives
   4 activision
   3 activism
  13 activist
   1 activistinvesto
   1 activitist
  47 activity
   1 actors
   4 acts
  14 actual
   3 actuall
  48 actually
   2 acushnet
  69 ad
   1 ad-based
   1 adafx
   5 adam
   3 adamfeuerstein
   3 adap
   7 adapt
   1 adaptability
   1 adapting
  75 adbe
  49 add
  52 added
   1 added/made
   3 addendum
   1 addidas
  39 adding
   8 addition
   1 additional
   7 additions
  11 address
   1 addressable
   7 addressed
   2 addresses
   1 addressing
  53 adds
   1 addtoyourwinners
  13 addyy
   2 adelson
   1 adhd
  11 adi
   9 adidas
  60 adj
   2 adjust
  27 adjusted
   7 adjustment
   5 adjustments
   1 adjustred
   2 adm
   5 admin
  11 administration
   1 admire
   1 admired
   5 admit
  10 admits
   6 admitted
  19 adobe
   1 adopt
   1 adopters
   2 adoption
   1 adopts
   3 adorable
   2 adore
   6 adp
   3 adrian
  55 ads
   2 ads.gr
   3 adsk
   1 adtn
   5 adult
   3 adults
   3 adv
   7 advance
  11 advanced
   1 advancing
  19 advantage
   4 advantages
   1 adventurous
   7 adversely
   3 advertised
   3 advertiser
   7 advertisers
  25 advertising
  11 advice
   1 advise
   8 adviser
   1 advises
   1 advising
  15 advisor
   6 advisors
   1 advisory
   1 advocate
   1 advocates
   1 aem
   2 aeo
   1 aep
   1 aerospace
   6 aes
   2 aesthetics
  12 aet
   1 af
   2 affair
  25 affect
  12 affected
   6 affecting
   8 affiliate
   2 affirmed
   1 affogato
   6 afford
   3 affordable
   1 afl
   1 aflac
   5 afoul
   4 afrezza
   4 africa
   1 african
 740 after
  24 after-hours
   2 after-hrs
   4 after-market
   2 afterhours
  36 afternoon
   1 afterwards
  11 ag
 192 again
 138 against
  16 age
   1 aged
   1 agen
   6 agencies
   5 agency
   2 agenda
   1 agent
   1 agents
   6 agg
   9 aggressive
  12 aggressively
   5 agi
   1 aging
   4 agitator
 135 agn
  98 ago
  28 agree
   5 agree/disagree
   2 agreed
   1 agreeing
  15 agreement
   1 agreement-anything
  22 agrees
   1 agrx
   1 agu
   1 agx
   5 ah
   1 aha
  10 ahahahaha
   1 ahca
 199 ahead
   1 ahhh
  63 ai
   1 ai-fueled
   7 aid
   2 aide
   1 aided
  27 aig
  15 aim
   1 aimed
   1 aiming
   6 aims
   5 ain
  17 air
   1 air-travel
   1 air-warehouse
   4 airbags
   3 airbnb
   1 aircraft
   1 airg
   1 airhub
  26 airline
   5 airliner
  41 airlines
   1 airplanes
   1 airplay
   2 airpod
  38 airpods
   1 airyy
   6 aisle
   1 ak
   8 aka
   5 akam
   2 akamai
   1 akao
   6 aks
   3 al
   1 alarm
   3 alberta
   1 albertsons
   1 albums
  14 alcoa
   2 alcohol
   1 aleppo
  17 alert
   1 alerts
   2 alessandro
   1 alex
  29 alexa
   1 alexa-
   6 alexander
   1 aleynikov
   1 algo
   9 algorithm
   1 algorithms
   5 algos
   1 alias
 132 alibaba
   1 alibaba-backed
   1 aligning
   2 alignment
   1 alison
   4 alive
   1 aliyun
   8 alk
   6 alks
 429 all
   1 all-consuming
  13 all-day
   1 all-in
   1 all-or-nothing
   2 all-star
   1 all-ti
   1 all-tim
 247 all-time
   1 all-time-high
   1 all-time-highs
   2 all-world
   3 alle
   1 allegedly
   1 allegheny
   6 alleging
  27 allergan
   6 alles
   7 alliance
   3 alligatorjaws
   1 allocate
   1 allocated
   1 allocation
   1 allocations
   1 allow
   1 allowed
   1 allowing
   1 allows
   1 alltime
   3 alludes
   3 alluring
  10 ally
  70 almost
   1 alny
   1 aloft
   6 alone
  10 along
   1 alongside
   1 alot
   2 alpha
 140 alphabet
   1 alpine
  65 already
   1 alright
 109 also
  19 altaba
   3 altered
   1 alternate
  10 alternative
   1 alternativefacts
   3 alternatives
  21 although
   7 alto
   1 altria
   2 alum
   3 alumni
   4 alv
   3 alway
  87 always
   8 alxn
  60 am
   1 am-er-i-can
   1 am/fm
   2 amadumb
   1 amag
  23 amat
  30 amazing
   1 amazing..
   1 amazing/free
   4 amazingly
 468 amazon
   1 amazon.let
   1 amazonprime
   1 amba
   6 amber
   1 ambiguity
   2 ambitions
   4 ambitious
  11 amc
  76 amd
 113 america
  52 american
   1 americanexpress
   6 americans
   2 americas
   1 ameritrade
   8 amex
  14 amgen
   3 amgen/regeneron
  76 amgn
   1 amgn-
  28 amid
   7 amidst
   6 amigo
   1 amlp
   1 amoled
  49 among
  16 amount
   6 amounts
1037 amp
   1 amped
   1 amplifies
   1 amps
   9 amrn
   1 amrs
   2 amt
   3 amtd
   1 amy
1030 amzn
 356 an
   1 analogue
  20 analysis
 126 analyst
  19 analyst_<num>
 164 analysts
   3 analytically
   8 analytics
   1 analyzing
2670 and
   1 and..
   1 and/or
   5 anderson
   1 andreessen
  17 andrew
   9 android
   1 ands
   1 andy
  20 anet
   2 anf
   2 angelo
   1 anglo
   1 anglogold
   1 angry
   1 angry/hate
   1 angst
   1 anice
   1 anilu
   2 animal
   1 anime
   1 anm
   1 anncts
  16 anniversary
   9 announce
  23 announced
  13 announcement
   3 announcements
  16 announces
   9 announcing
   2 annoyance
   2 annoying
  13 annual
   3 annualized
   1 annually
   5 annuls
   1 anokion
 176 another
  24 answer
   1 answering
   6 answers
   6 ant
   1 antenna
   2 antes
   2 anthem
   2 anthony
   2 anti
   1 anti-
   1 anti-ban
   1 anti-bigotry
   1 anti-fragile
   4 anti-japanese
   3 anticipated
   1 anticipates
   4 anticipating
   4 anticipation
  10 antitrust
  18 antm
   1 anto
   1 antofagasta
   1 antonio
 100 any
   2 anyhoo
  16 anymore
  39 anyone
  32 anything
   1 anytime
   3 anyway
  10 anywhere
   1 aobc
   6 aol
   3 ap
   2 apa
   1 apac
   2 apache
   1 apam
   3 apart
   2 aperture
   1 aph
   8 api
   1 apiary
   1 apiece
   1 apigee
   6 apocalypse
   4 apologizes
   1 apology
  72 app
   4 app-related
  10 apparel
   7 apparently
  32 appdynamics
  16 appeal
   2 appealing
   4 appeals
  21 appear
   4 appearance
   8 appears
   2 appetite
   2 applauded
   5 applause
1173 apple
   1 apple-samsung
   1 apple/qualcomm
   1 applemusic
   2 apples
   2 appletalk
   4 applewatch
   1 applicable
   4 application
   2 applications
   5 applied
   3 apply
   1 appointees
   3 appreciate
   2 appreciated
   1 appreciates
   2 appreciation
   1 apprenticeship
  30 approach
   4 approached
   2 approaches
   4 approaching
   3 appropriately
   8 approval
   1 approve
   2 approved
   3 approves
   1 approx
   2 approximately
  23 apps
   1 appstore
   6 apr
   1 apri
  22 april
   2 apron
   9 ar
   1 ar-capable
   1 arabia
   2 arabic
   6 aramco
   1 arby
   1 architectural
   2 arconic
   1 arctic
  10 arcuri
 849 are
  30 area
   1 area-levels
   4 areas
   1 aren'tdoing
   2 arena
   2 arguably
   9 argue
   4 argument
   6 arguments
   4 argus
   1 ari
   9 aria
   1 ariad
   1 arino'ing
  13 arista
   5 aristocrats
   1 aristotle
   4 arizona
   1 ark
   7 arkansas
   5 arm
   1 arm-based
   2 armchair
  29 armour
   6 arms
   2 army
   3 arna
  12 arnc
   1 arne
 113 around
   1 arpu
   5 arrive
   2 arrived
  16 arrows
   1 arrs
   7 arry
   1 ars
   2 art
   9 article
   4 articles
   3 articulate
   4 artificial
   9 arts
   2 arwr
 994 as
  10 asap
   2 ascent
   3 ashr
  45 asia
   2 asian
   7 aside
  31 ask
  12 asked
  16 asking
  12 asks
   8 askwarren
   1 asmb
   3 asml
   7 asp
   1 aspirations
   4 aspiring
   8 ass
   3 assault
   1 assemble
   4 assembly
   5 assertions
   4 assessing
   6 asset
  47 assets
   1 asshole
   1 assign
   1 assignment
   9 assistance
   4 assistant
   3 assistants
   2 assoc
  11 associated
   2 association
   1 assortment
   8 assume
   8 assuming
   5 assumption
   1 ast
   3 astonishing
   5 astounding
   1 astrazenica
1027 at
   1 at-home
  10 at-the-money
   4 ate
  34 ath
   2 ath+
   2 athlete
   2 athletic
   5 athn
   1 aths
   5 ati
   5 atlantic
   1 atlassian
   6 atln
   9 atm
   1 att
   1 attach
   3 attack
   9 attacks
   5 attempt
   3 attendees
   1 attending
  31 attention
   2 attitude
   3 attitudes
   1 attn
  12 attorney
   6 attract
   4 attracting
   3 attractive
   1 attributable
   1 attributed
   1 attributes
   5 atu
  26 atvi
   3 atx
   1 atxtech
   1 au
   1 aubiz
   1 aubrey
   3 audi
   3 audience
   2 audiences
   5 audio
  10 audit
   1 audited
   5 auditees
   5 auditor
   2 audits
  14 augmented
   2 augmentedreality
   6 august
   8 ausbiz
   2 austin
   5 australia
   1 australian
   1 authenticators
  45 auto
   4 auto-blocking
   1 autocorrect
   1 autoimmune
   5 automakers
   1 automate
   6 automated
   1 automating
   1 automation
   1 automobile
   3 automotive
   1 autonation
  23 autonomous
   1 autonomous-cars
   1 autonomous-drive
   1 autonomous-driving
   6 autonomousvehicles
  19 autopilot
   3 autos
   1 autozone
   1 auvi-q
   1 auy
  16 available
   1 avav
   2 avenue
  61 average
   2 averaged
   3 averages
   3 averse
   1 aversion
  40 avg
   1 avg.
  26 avgo
   1 avian
   4 aviation
  30 avoid
   6 avoiding
   1 avoids
  11 avp
   1 avy
   1 avycaz
   2 aw
   1 await
   1 awaited
   1 awaiting
   6 award
   8 awards
   3 aware
   4 awareness
  77 away
   1 away..
  18 awesome
   9 awful
   5 awhile
   2 awkward
  19 aws
   1 awsoutage
   2 axdx
   2 axon
  59 axp
   2 axti
   1 azmn
   7 azn
  12 azo
   6 azure
  18 b
   5 b'berg
   4 b'fast
   5 b-day
   1 b-dubs
   9 b/c
  83 ba
   1 baaaaad
 319 baba
   1 baba-
  14 baby
 379 bac
   1 bach
 246 back
   1 back-half
   1 back-month
   1 back-test
   7 back-tester
   1 back-testing
   8 back-tests
   1 back-to-back
   2 backburner
   4 backdrop
   4 backed
   4 backend
   1 backers
   5 background
   9 backing
   4 backlash
   5 backorder
   1 backordered
   1 backpacks
   1 backs
   1 backseat
   2 backtest
   5 backtester
   3 backyard
   1 bacon
  68 bad
   2 badass
  11 badly
   1 baffles
  10 bag
   1 bagels
   4 bagged
   5 bah
   1 bai
  14 baidu
   5 bail
   6 bailed
   1 bailing
   2 bails
   8 baird
   1 bakken
  27 balance
   1 balanced
   1 balances
   4 ball
   1 ballgame
   5 ballmer
   6 ballroom
   1 balls
   1 ballsy
   2 bam
  67 ban
   3 bananas
   1 banc
   7 band
   1 band-aid
   2 bandits
   5 bandwidth
   5 bang
   1 bangalore
   3 bangarang
   3 banged
 199 bank
   1 bank/financial
   1 banker
   1 banker/
  21 bankers
  17 banking
   3 bankofamerica
   1 bankrupt
   1 bankrupting
  95 banks
   6 banned
   2 banner
   5 banyon
   6 bar
   1 barbie
   6 barclays
  11 barely
   5 bargain
   1 barista
   4 baristaproblems
  24 baristas
   2 barnes
   4 baron
   5 barra
   1 barracuda
   6 barrels
   3 barren
   3 barrier
   1 barris
  12 barron
   1 barry
   2 bars
   1 bartz
  21 base
   1 baseball
  38 based
   1 bases
   2 basham
   1 bashing
   7 basic
  11 basically
   8 basics
   3 basin
  20 basis
   5 basket
   3 basketball
   2 bass
   1 bastard
   1 bat
   2 bath
   1 batseurope
   2 batteries
  17 battery
  14 battle
   1 battled
  13 battlefield
   2 battlefront
   1 bay
   1 bazillion
   9 bb
   1 bb.to
  16 bbby
   2 bbc
  38 bbry
  12 bbt
   5 bbw
  18 bby
   6 bc
   1 bcov
   1 bcr
   4 bcrx
   2 bcs
   1 bdx
 837 be
   1 beam
   2 beans
  67 bear
   1 bearing
  30 bearish
   3 bearishness
  53 bears
   4 beast
   1 beast-mode
 168 beat
   1 beaten
   1 beaten-down
  73 beating
 160 beats
   1 beatsx
   1 beauties
  16 beautiful
  13 beauty
   7 became
  88 because
  62 become
   9 becomes
  23 becoming
   1 becton
   1 becuz
   2 bed
   1 beefs
 248 been
   1 been/still
   1 beer
   1 befor
 142 before
   2 beforehand
  16 began
   5 beggars
   8 begin
   4 beginning
  20 begins
   4 begun
   1 behalf
   1 behaved
   2 behaving
   2 behavior
   1 behemoths
  29 behind
   2 beige
  65 being
   5 belief
  40 believe
   1 believed
   2 believer
   2 believers
  12 believes
   3 believing
   1 belivers
  56 bell
   1 bellini
   1 bells
   1 belong
   2 belongs
   4 beloved
 227 below
   1 belt
   2 belviq
   5 ben
  11 benchmark
   4 beneath
   1 beneficial
   2 beneficiary
  15 benefit
   3 benefiting
  10 benefits
   2 benefitted
   1 bengaluru
   1 benioff
   1 benowitz
   1 bent
  11 benzinga
   1 bep
   1 bereavement
  12 berkshire
   5 berlin
  20 bernstein
   1 bertha
   1 besides
   1 bessant
 189 best
   2 best-in-class
   4 best-performing
   1 best-quarter
   3 best-selling
   1 bestguess
   1 bestselling
   1 beststates
  50 bet
   6 beta
   1 betr
  20 bets
  95 better
   1 better-than-average
   3 better-than-expected
   1 better..
   4 bettercup
  39 betting
  55 between
   1 bevs
  10 beware
   1 beykpour
  22 beyond
   9 bezos
   6 bff
   1 bffs
   1 bg
   1 bhi
   6 bhp
   2 bi
   2 biased
   3 biases
   1 bic+taf
   6 bictegravir
  38 bid
   1 bid-ask
   1 bidder
   1 bidders
   2 bidding
   1 biden
  37 bidu
 413 big
   1 big-bank
   5 big-box
   3 big-time
   1 bigcall
   1 bigd
  55 bigger
 119 biggest
   1 biggest-ever
   1 biggie
   2 bigly
   2 bigmac
   5 bigness
   1 bigroundnumbers
   1 bigtime
   6 biib
   9 bil
  55 bill
   4 billackman
   1 billboards
   1 billed
   1 billings
 251 billion
   2 billion-dollar
   2 billion-plus
   8 billionaire
   1 billionaires
   1 billionairism
   6 billions
   1 billiton
   6 bills
   1 bing
   5 binge
   2 bingo
   1 bio
   1 bio-twitter
   2 bioc
   1 biometric
   4 biopharma
   1 biosciences
   5 biosimilar
  20 biotech
   2 biotechs
   6 bird
   1 birds
   4 birthday
   1 bisaro
   1 bistro
  57 bit
   1 bitch
  20 bitcoin
   1 bitcoinprice
   4 bite
   1 bites
   7 bitter
   1 bittersweet
  33 biz
   8 bizarre
   1 bjri
   5 bk
   4 bks
   1 bkw
   4 bkx
  11 black
  22 blackberry
   1 blackhistorymonth
   5 blackledge
   2 blacklisted
   3 blackmon
   2 blackrock
   3 blah
  18 blame
   5 blames
  28 blankfein
   1 blastoff
   1 blasts
   1 blatant
   3 blcm
   1 bldp
   5 bleed
   1 bleeding
   1 blend
   3 blended
   1 bless
   1 blessed
   2 blew
   1 blimp
   1 blip
   1 blistering
   6 blizzard
  12 blk
   1 bll
   1 blmn
  14 bln
   1 bloated
   6 block
   8 blockbuster
   1 blockbusters
   6 blockchain
   6 blocked
   1 blockers
   8 blocking
   4 blocks
  84 blog
   1 blogging
   5 blood
   1 bloodbath
   1 bloom
  26 bloomberg
  16 blow
   9 blow-off
   4 blow-out
   1 blow-up
   1 blowing
   7 blown
  13 blowout
   1 blowouts
   5 blows
  20 blue
   1 blues
   3 blunder
   1 blur
   5 bmo
   3 bmrn
   2 bmw
   1 bmwyy
  27 bmy
   3 bn
   1 bna
   2 bntc
  58 board
   1 boasting
   1 boasts
   6 boat
   6 bob
   2 bobe
   3 bode
   4 bodes
   4 body
   1 body-sculptor
  33 boeing
  30 bofa
   1 bogey
   1 bogged
   4 bogus
   1 boil
   5 boilerplate
   2 boj
   1 bok
   2 bold
   5 boldforlife
   1 bollinger
   2 bolster
   1 bolstered
   2 bolt
   4 bomb
   3 bonanza
  25 bond
   2 bond-trading
   5 bondholders
  30 bonds
   4 bonds/notes
   2 bont
  21 bonus
   4 bonuses
   1 boo
  10 book
   3 booked
   5 bookmark
   5 books
   1 bookstore
   5 bookstores
  13 boom
   1 boom.trailer
   1 boomer
  16 booming
   1 booms
  41 boost
   1 boosted
   1 boosting
  11 boosts
   6 boot
   5 boot-on
   3 booth
   4 booting
   3 booze
   1 bopco
  13 border
   1 bore
  12 boring
   1 born
   6 borrow
   1 bosh
   6 boss
   3 boston
   2 bot
  63 both
